[
    {
        "Title": "A Secure and Flexible Blockchain-Based Offline Payment Protocol",
        "Authors": "Wanqing Jie; Wangjie Qiu; Arthur Sandor Voundi Koe; Jianhong Li; Yin Wang; Yaqi Wu; Jin Li; Zhiming Zheng; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10316333/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10316333",
        "Abstract": "Off-chain transactions seek to address the low on-chain scalability and enable blockchain-based payments over unreliable on-chain networks. The key problem with existing works is that they fail to balance security and flexibility in their designs. These studies would have been more useful if they could provide a sense of security without compromising their flexibility. We hypothesize that two offline parties having loosely synchronized clocks and channels with known bounded latency can conduct off-chain transactions while maintaining a high level of security and flexibility: we introduce a novel blockchain-based offline payment protocol that supports our hypothesis. Our work leverages on-chain smart contracts and offline wallet interactions to build resilience against intermittent on-chain connectivity. Our protocol achieves flexible and trusted computations with the use of platform-agnostic Trusted Execution Environments (TEEs) and open transactions. We empirically evaluate our design over the mainstream Intel Software Guard Extensions (SGX) and compare our protocol with state-of-the-art solutions. We found that our protocol attains high efficiency and exhibits an advanced level of security and flexibility in functionality. We evaluate our construction against several real-world attacks. We prove the security and robustness of our scheme based on a practical universally composable framework with synchronous settings. This work contributes to the existing knowledge of safe and user-friendly offline payment solutions for the blockchain technology.",
        "Published in": "IEEE Transactions on Computers",
        "Date of Publication": "13 November 2023",
        "Page(s)": "408 - 421",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TC.2023.3331823",
        "DOI Link": "https://doi.org/10.1109/TC.2023.3331823",
        "Publisher": "IEEE"
    },
    {
        "Title": "NutBaaS: A Blockchain-as-a-Service Platform",
        "Authors": "Weilin Zheng; Zibin Zheng; Xiangping Chen; Kemian Dai; Peishan Li; Renfei Chen; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8840920/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8840920",
        "Abstract": "",
        "Published in": "",
        "Date of Publication": "",
        "Page(s)": "",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "",
        "DOI Link": "",
        "Publisher": ""
    },
    {
        "Title": "Blockchain-Enabled Smart Contracts: Architecture, Applications, and Future Trends",
        "Authors": "Shuai Wang; Liwei Ouyang; Yong Yuan; Xiaochun Ni; Xuan Han; Fei-Yue Wang; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8643084/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8643084",
        "Abstract": "In recent years, the rapid development of cryptocurrencies and their underlying blockchain technology has revived Szabo’s original idea of smart contracts, i.e., computer protocols that are designed to automatically facilitate, verify, and enforce the negotiation and implementation of digital contracts without central authorities. Smart contracts can find a wide spectrum of potential application scenarios in the digital economy and intelligent industries, including financial services, management, healthcare, and Internet of Things, among others, and also have been integrated into the mainstream blockchain-based development platforms, such as Ethereum and Hyperledger. However, smart contracts are still far from mature, and major technical challenges such as security and privacy issues are still awaiting further research efforts. For instance, the most notorious case might be “The DAO Attack” in June 2016, which led to more than $50 million Ether transferred into an adversary’s account. In this paper, we strive to present a systematic and comprehensive overview of blockchain-enabled smart contracts, aiming at stimulating further research toward this emerging research area. We first introduced the operating mechanism and mainstream platforms of blockchain-enabled smart contracts, and proposed a research framework for smart contracts based on a novel six-layer architecture. Second, both the technical and legal challenges, as well as the recent research progresses, are listed. Third, we presented several typical application scenarios. Toward the end, we discussed the future development trends of smart contracts. This paper is aimed at providing helpful guidance and reference for future research efforts.",
        "Published in": "IEEE Transactions on Systems, Man, and Cybernetics: Systems",
        "Date of Publication": "15 February 2019",
        "Page(s)": "2266 - 2277",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TSMC.2019.2895123",
        "DOI Link": "https://doi.org/10.1109/TSMC.2019.2895123",
        "Publisher": "IEEE"
    },
    {
        "Title": "Delay Analysis of Consensus Communication for Blockchain-Based Applications Using Network Calculus",
        "Authors": "Shengcheng Ma; Shuai Wang; Wei-Tek Tsai; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9796648/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9796648",
        "Abstract": "Blockchain has been witnessed a growing application in mobile communication. The application field ranges from the Internet of Things (IoT), Vehicle to Everything (V2X), Mobile Edge Computing (MEC), etc. The conjunction with blockchain can significantly avoid data tempering and protect user privacy. Although blockchain guarantees the security of mobile communication, the operation cost is increasing. The consensus algorithm of blockchain drives multiple untrust parties to keep data consistency, and it generates a large number of communication overheads. In this letter, we focus on the Byzantine Fault Tolerance (BFT) type of consensus and conduct a performance model. By utilizing the deterministic network calculus method, we analyze the delay bound of the Practical Byzantine Fault Tolerance (PBFT) and HotStuff consensus algorithm. The result of the simulation provides a valuable guideline for delay-sensitive blockchain-based applications.",
        "Published in": "IEEE Wireless Communications Letters",
        "Date of Publication": "15 June 2022",
        "Page(s)": "1825 - 1829",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/LWC.2022.3183197",
        "DOI Link": "https://doi.org/10.1109/LWC.2022.3183197",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey on Blockchain Technology: Evolution, Architecture and Security",
        "Authors": "Muhammad Nasir Mumtaz Bhutta; Amir A. Khwaja; Adnan Nadeem; Hafiz Farooq Ahmad; Muhammad Khurram Khan; Moataz A. Hanif; Houbing Song; Majed Alshamari; Yue Cao; ; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9402747/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9402747",
        "Abstract": "Blockchain is a revolutionary technology that is making a great impact on modern society due to its transparency, decentralization, and security properties. Blockchain gained considerable attention due to its very first application of Cryptocurrencies e.g., Bitcoin. In the near future, Blockchain technology is determined to transform the way we live, interact, and perform businesses. Recently, academics, industrialists, and researchers are aggressively investigating different aspects of Blockchain as an emerging technology. Unlike other Blockchain surveys focusing on either its applications, challenges, characteristics, or security, we present a comprehensive survey of Blockchain technology's evolution, architecture, development frameworks, and security issues. We also present a comparative analysis of frameworks, classification of consensus algorithms, and analysis of security risks & cryptographic primitives that have been used in the Blockchain so far. Finally, this paper elaborates on key future directions, novel use cases and open research challenges, which could be explored by researchers to make further advances in this field.",
        "Published in": "IEEE Access",
        "Date of Publication": "13 April 2021",
        "Page(s)": "61048 - 61073",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3072849",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3072849",
        "Publisher": "IEEE"
    },
    {
        "Title": "An Efficient Double-Layer Blockchain Method for Vaccine Production Supervision",
        "Authors": "Shaoliang Peng; Xing Hu; Jinglin Zhang; Xiaolan Xie; Chengnian Long; Zhihui Tian; Hongbo Jiang; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9107255/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9107255",
        "Abstract": "A vaccine is a biological product which is an important means for human beings to protect themselves. Most of its users are young children with weak immunity. Once a vaccine has a problem, it will pose a serious threat to the lives of many people. At present, the supervision of vaccine production is very simple. The vaccine production record is completely controlled by the enterprises. Enterprises only submit production records to the supervisory agency for review when the vaccine needs to be sold. Production records are easily forged and modified. In order to solve the shortcomings of traditional centralized management. We propose a supervision method for vaccine production based on double-level blockchain. At first, we have designed a double-level blockchain structure. The first level is private data of vaccine prduction enterprise, including production records and corresponding hash. The next level is public data, including production records hash and vaccine information. In this way, we make vaccine enterprise to submit production records in a timely manner without fear of privacy leaks. We avoid enterprise tampering or falsification of production records through the non-tampering features and time stamps of the blockchain. To improve the time efficiency, we propose a consensus mechanism for multi-node cooperate. The primary supervisory node provides sorting services and verifies the correctness of the blockchain replica. The ordinary supervisory node can replace the primary supervisory node when necessary, and help the primary supervisory node recovers data in case of information loss. The review node is responsible for providing complete and correct blockchain copies for other nodes. So we can avoids the problem of waste of time resources in the traditional blockchain system. In addition, in order to avoid the waste of space caused by the redundancy of the blockchain, we propose a vaccine data cutting mechanism. We use the timestamp of the blockchain and the v...",
        "Published in": "IEEE Transactions on NanoBioscience",
        "Date of Publication": "03 June 2020",
        "Page(s)": "579 - 587",
        "Electronic ISSN": "",
        "PubMed ID": "32603300",
        "DOI": "10.1109/TNB.2020.2999637",
        "DOI Link": "https://doi.org/10.1109/TNB.2020.2999637",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Blockchain Oracle Interoperability Technique for Permissioned Blockchain",
        "Authors": "Asma A. Alhussayen; Kamal Jambi; Maher Khemakhem; Fathy E. Eassa; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10530044/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10530044",
        "Abstract": "Blockchain interoperability has become an essential requirement for the advancement of blockchain technology in numerous fields. Enterprise organizations are increasingly utilizing permissioned blockchains to manage and store their organizations’ data and transactions in a private immutable ledger. Interoperability enables permissioned blockchain platforms to communicate and exchange information which is paramount for fully exploiting permissioned blockchains as facilitators for B2B applications. Additionally, the cross-network invocation of smart contracts under agreed conditions enhances business operations. Blockchain oracles can enable permissioned blockchain interoperability and cross-network transactions in a seamless and private manner. However, they have not been studied in the literature as interoperability techniques between permission blockchains. This study proposes a blockchain oracle interoperability technique designed specifically for permissioned blockchain platforms. We presented the architecture of the blockchain oracle interoperability technique and a prototypical implementation to demonstrate the practicality of the proposed technique. In addition, we obtained cross-network transaction latency measurements and analyzed the results.",
        "Published in": "IEEE Access",
        "Date of Publication": "13 May 2024",
        "Page(s)": "68130 - 68148",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3400672",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3400672",
        "Publisher": "IEEE"
    },
    {
        "Title": "Evaluation and Demonstration of Blockchain Applicability Framework",
        "Authors": "Sri Nikhil Gupta Gourisetti; Michael Mylrea; Hirak Patangia; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8822381/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8822381",
        "Abstract": "Blockchain technology has been gaining great interest from a variety of industry sectors, including financial, food processing, and power and energy markets. Realizing the strength of blockchain technology beyond the successful application in the cryptocurrency arena, researchers have been evaluating and using blockchain for applications such as supply chain management, transactive industry (both financial and energy), system integrity, device cybersecurity, identity management, and much more. One of the unique elements of the blockchain technology that made it such a captivating technology to researchers is its plethora of features. Some of the features include smart contracts, cryptocurrency and tokenizing, immutable distributed ledger, cryptographic hashing, and digital signature. In addition, there are multiple types of blockchains, such as permissioned/private and permissionless/public, and various consensus models, such as proof-of-work, proof-of-authority, proof-of-burn, and proof-of-stake. Therefore, it is often nontrivial to determine if an application requires a blockchain. If so, what kind of blockchain and consensus is most appropriate? This article discusses the blockchain applicability framework (BAF), which was specifically designed with the purpose to answer those questions. The BAF is divided into five domains, 18 subdomains, and about 100 controls. It is designed to ingest detailed user requirements to perform a weighted evaluation that is built on mathematical constructs to determine the ideal combination of blockchain that is appropriate for an application. Along with the core logical formulation of the BAF, this article depicts the efficacy of the BAF through two use cases.",
        "Published in": "IEEE Transactions on Engineering Management",
        "Date of Publication": "02 September 2019",
        "Page(s)": "1142 - 1156",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TEM.2019.2928280",
        "DOI Link": "https://doi.org/10.1109/TEM.2019.2928280",
        "Publisher": "IEEE"
    },
    {
        "Title": "Drawing the Boundaries Between Blockchain and Blockchain-Like Systems: A Comprehensive Survey on Distributed Ledger Technologies",
        "Authors": "Badr Bellaj; Aafaf Ouaddah; Emmanuel Bertin; Noel Crespi; Abdellatif Mezrioui; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10517413/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10517413",
        "Abstract": "Bitcoin’s success as a global cryptocurrency has paved the way for the emergence of blockchain, a revolutionary category of distributed systems. However, the growing popularity of blockchain has led to a significant divergence from its core principles in many systems labeled as “blockchain.” This divergence has introduced complexity into the blockchain ecosystem, exacerbated by a lack of comprehensive reviews on blockchain and its variants. Consequently, gaining a clear and updated understanding of the diverse spectrum of current blockchain and blockchain-like systems has become challenging. This situation underscores the necessity for an extensive literature review and the development of thematic taxonomies. This survey seeks to offer a comprehensive and current assessment of existing blockchains and their variations while delineating the boundaries between blockchain and blockchain-like systems. To achieve this objective, we propose a holistic reference model for conceptualizing and analyzing these systems. Our layer-wise framework envisions all distributed ledger technologies (DLTs) as composed of four principal layers: data, consensus, execution, and application (DCEA). In addition, we introduce a new taxonomy that enhances the classification of blockchain and blockchain-like systems, offering a more useful perspective than existing works. Furthermore, we conduct a state-of-the-art review from a layered perspective, employing 23 evaluative criteria predefined by our framework. We perform a qualitative and quantitative comparative analysis of 44 DLT solutions and 26 consensus mechanisms while discussing differences and boundaries between blockchain and blockchain-like systems. We emphasize the significant challenges and tradeoffs encountered by distributed ledger designers, decision-makers, and project managers during the design or adoption of a DLT solution. Finally, we outline crucial research challenges and directions in the field of DLTs.",
        "Published in": "Proceedings of the IEEE",
        "Date of Publication": "02 May 2024",
        "Page(s)": "247 - 299",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JPROC.2024.3386257",
        "DOI Link": "https://doi.org/10.1109/JPROC.2024.3386257",
        "Publisher": "IEEE"
    },
    {
        "Title": "Meepo: Multiple Execution Environments per Organization in Sharded Consortium Blockchain",
        "Authors": "Peilin Zheng; Quanqing Xu; Zibin Zheng; Zhiyuan Zhou; Ying Yan; Hui Zhang; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9916259/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9916259",
        "Abstract": "Blockchain performance cannot meet the requirement nowadays. One of the crucial ways to improve performance is sharding. However, most blockchain sharding research focuses on the public blockchain. As for consortium blockchain, previous studies cannot support high cross-shard efficiency, multiple-shard contract calling, strict transaction atomicity, and shard availability, which are essential requirements but also challenges in consortium blockchain systems. Facing these challenges, we propose Meepo, a systematic study on sharded consortium blockchain. Meepo enhances cross-shard efficiency via the cross-epoch and cross-call. Moreover, a partial cross-call merging strategy is designed to handle the multi-state dependency in contract calls, achieving flexible multiple-shard contract calling. Meepo employs a replay-epoch to ensure strict transaction atomicity, and it also uses a backup algorithm called shadow shard based recovery to improve the shard robustness. On a test-bed of 128 AliCloud servers, setting 32 shards and 4 consortium members, Meepo-OpenEtheruem can achieve more than 140,000 cross-shard TPS under the workload of 100,000,000 asset transactions. It also shows more than 50,000 TPS under the transactions of real-world shopping behaviors.",
        "Published in": "IEEE Journal on Selected Areas in Communications",
        "Date of Publication": "12 October 2022",
        "Page(s)": "3562 - 3574",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JSAC.2022.3213326",
        "DOI Link": "https://doi.org/10.1109/JSAC.2022.3213326",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain and Smart Contracts for Telecommunications: Requirements vs. Cost Analysis",
        "Authors": "Nima Afraz; Francesc Wilhelmi; Hamed Ahmadi; Marco Ruffini; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10232988/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10232988",
        "Abstract": "Blockchain technology offers solutions to numerous network problems by leveraging distributed record-keeping and collaborative decision-making features. However, deployment considerations such as blockchain infrastructure cost, performance requirements, and scalability are often overlooked. This paper provides an in-depth perspective on deploying blockchain-based solutions for telecommunications networks, estimating costs, comparing infrastructure options (on-premises, IaaS, BaaS), and choosing a suitable blockchain platform. To that end, we identify the performance limitations of the proposed solution under various deployment infrastructures by studying two prominent use cases: one proposing a distributed marketplace solution for 5G slice brokering and another one on the decentralization of federated learning (FL) through blockchain. For the slice brokering use case, our experiments showed that sub-second latency could be achieved for a maximum transaction throughput in the range of 10 to 200 transactions per second (TPS), whereas use cases requiring a higher throughput (300 to 400 TPS) would need more computational resources. Meanwhile, the FL use case provided insights into the achievable accuracy of distributed learning under various blockchain settings (public, consortium, and private), which led to the understanding that private and consortium blockchains can achieve acceptable accuracy in significantly lower training times compared to public blockchains.",
        "Published in": "IEEE Access",
        "Date of Publication": "28 August 2023",
        "Page(s)": "95653 - 95666",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2023.3309423",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2023.3309423",
        "Publisher": "IEEE"
    },
    {
        "Title": "Permissionless and Permissioned, Technology-Focused and Business Needs-Driven: Understanding the Hybrid Opportunity in Blockchain Through a Case Study of Insolar",
        "Authors": "Henry M. Kim; Hjalmar Turesson; Marek Laskowski; Amir Fard Bahreini; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9137695/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9137695",
        "Abstract": "Blockchains can be public, permissionless networks implementing novel cryptocurrency-based technology features or permissioned, interorganizational networks championed by industry consortia. Some ventures operationalize a hybrid of these two network types to enhance adoption of their blockchain platforms by broadening their base of stakeholders or facilitating interoperability between heterogeneous blockchains. In this article, we synthesize literature and industry writings to identify four hybrid blockchain architectures: hybrid blockchain approach, connected hybrid blockchain, interoperable blockchain architecture, and hard-forked blockchain for enterprise use. We then analyze these architectures along dimensions of semantic modeling support between private and public networks, data connectivity between networks, syntactic interoperability support between networks with heterogeneous codebases, governance model, and technical features. We find that hybrid blockchain ventures make trade-offs: support API's, tools, and customized development so that a codebase is useful for private and public networks or provide such support for interoperation between heterogeneous codebases. We then conduct a case study of an exemplar for a hybrid blockchain approach, the startup Insolar. We identify characteristics that have led Insolar to be idiosyncratically agile and effective in its blockchain development, which together with our architecture analysis may be timely and prescriptive as enterprises grow interested in addressing blockchain hybridity and interoperability.",
        "Published in": "IEEE Transactions on Engineering Management",
        "Date of Publication": "09 July 2020",
        "Page(s)": "776 - 791",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TEM.2020.3003565",
        "DOI Link": "https://doi.org/10.1109/TEM.2020.3003565",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain Standards and Government Applications",
        "Authors": "",
        "HTML Link": "https://ieeexplore.ieee.org/document/10259662/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10259662",
        "Abstract": "Many people talk about blockchain but very few understand its true nature and potential. Blockchain seems very exciting yet simultaneously a bit confusing, and naturally many people, businesses, and governments approach it with high expectations while also exhibiting some hesitancy. This article will deal with the use of blockchain in relation to government applications. A proper assessment of such use requires a discussion on blockchain standards, which are currently developed, or may develop in the future. Without blockchain standards, any potential use of blockchain in government will be of limited and restricted value. This would render our discussion on government applications rather limited too. Standards enable us to appreciate blockchain applications in a useful way for future applications outside the context of government. Focusing our attention to government applications is deliberate. Blockchain, obviously, provides amazing opportunities for the private sector. Over the last years there has been widespread public disbelief in many public and government institutions. Corruption, fraud, lack of transparency, alienation and disconnection of citizen from decision-making centres oblige governments to change and offer proper governance conditions for their citizens. Further, higher consumer expectations in all sectors of the economy naturally affect the expectations of citizens vis-à-vis their governments. For the above reasons, governments could leverage the positive features of blockchain to restore their reputation and efficiency towards citizens, by using blockchain. Of course, governments can use blockchain for many of their applications. To decide the proper application of blockchain within their operations, governments must embark on a need-based approach. Standards are extremely useful in such a need-based approach.",
        "Published in": "Journal of ICT Standardization",
        "Date of Publication": "2019",
        "Page(s)": "287 - 312",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.13052/jicts2245-800X.736",
        "DOI Link": "https://doi.org/10.13052/jicts2245-800X.736",
        "Publisher": "River Publishers"
    },
    {
        "Title": "Exploring Sybil and Double-Spending Risks in Blockchain Systems",
        "Authors": "Mubashar Iqbal; Raimundas Matulevičius; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9435780/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9435780",
        "Abstract": "The first step to realise the true potential of blockchain systems is to explain the associated security risks and vulnerabilities. These risks and vulnerabilities, exploited by the threat agent to affect the valuable assets and services. In this work, we use a security risk management (SRM) domain model and develop a framework to explore two security risks - Sybil and Double-spending - that are observed and considered most concerning security risks within blockchain systems. The framework illustrates the protected assets or assets to secure, the classification of threats that the attacker can trigger using Sybil attack, the identification of threats that cause Double-spending, the vulnerabilities of identified threats, and their countermeasures. We evaluated a newly built framework by exploring Sybil and Double-spending risks in Ethereum-based healthcare applications. We also recognise the various other security and implementation challenges of blockchain that hinder the acceptance of blockchain-enabled solutions. Furthermore, we discuss the permissioned blockchain systems making an appearance in industry-level enterprises and how permissioned blockchain systems control these challenges. We conclude the paper and outline the future work that aims to build an ontology-based blockchain security reference model. The results of this work could help blockchain developers, practitioners, and other associated stakeholders to communicate about Sybil and Double-spending risks, what security countermeasures should be introduced, and what security and implementation challenges are emerging in blockchain systems.",
        "Published in": "IEEE Access",
        "Date of Publication": "19 May 2021",
        "Page(s)": "76153 - 76177",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3081998",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3081998",
        "Publisher": "IEEE"
    },
    {
        "Title": "Analysis of Data Management in Blockchain-Based Systems: From Architecture to Governance",
        "Authors": "Hye-Young Paik; Xiwei Xu; H. M. N. Dilum Bandara; Sung Une Lee; Sin Kuang Lo; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8938787/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8938787",
        "Abstract": "In a blockchain-based system, data and the consensus-based process of recording and updating them over distributed nodes are central to enabling the trustless multi-party transactions. Thus, properly understanding what and how the data are stored and manipulated ultimately determines the degree of utility, performance, and cost of a blockchain-based application. While blockchains enhance the quality of the data by providing a transparent, immutable, and consistent data store, the technology also brings new challenges from a data management perspective. In this paper, we analyse blockchains from the viewpoint of a developer to highlight important concepts and considerations when incorporating a blockchain into a larger software system as a data store. The work aims to increase the level of understanding of blockchain technology as a data store and to promote a methodical approach in applying it to large software systems. First, we identify the common architectural layers of a typical software system with data stores and conceptualise each layer in blockchain terms. Second, we examine the placement and flow of data in blockchain-based applications. Third, we explore data administration aspects for blockchains, especially as a distributed data store. Fourth, we discuss the analytics of blockchain data and trustable data analytics enabled by blockchain. Lastly, we examine the data governance issues in blockchains in terms of privacy and quality assurance.",
        "Published in": "IEEE Access",
        "Date of Publication": "23 December 2019",
        "Page(s)": "186091 - 186107",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2019.2961404",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2019.2961404",
        "Publisher": "IEEE"
    },
    {
        "Title": "When Blockchain Meets SGX: An Overview, Challenges, and Open Issues",
        "Authors": "Zijian Bao; Qinghao Wang; Wenbo Shi; Lei Wang; Hong Lei; Bangdao Chen; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9197584/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9197584",
        "Abstract": "As a decentralized, public, and digital ledger technology in Peer-to-Peer network, blockchain has received much attention from various fields, including finance, healthcare, supply chain, etc. However, some challenges (e.g., scalability, privacy, and security issues) severely affects the wide adoption of blockchain technology. Recently, Intel software guard extensions (SGX), as new trusted computing technologies, have provided a new solution to the above challenges in the blockchain area. Although many studies have focused on using SGX technology to enhance their schemes in the blockchain areas, no comprehensive survey has systematically analyzed and delineated these studies. This article is the first to systematically discuss the application status of SGX in the blockchain area. In this article, we study the scheme designs, advantages, and disadvantages of the existing works using a six-layer hierarchical structure of the blockchain. We also summarize the functions of SGX and formally analyze the advantages and disadvantages of SGX. Finally, we review the remaining challenges and present a list of possible directions for future research.",
        "Published in": "IEEE Access",
        "Date of Publication": "15 September 2020",
        "Page(s)": "170404 - 170420",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.3024254",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.3024254",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Vademecum on Blockchain Technologies: When, Which, and How",
        "Authors": "Marianna Belotti; Nikola Božić; Guy Pujolle; Stefano Secci; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8760539/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8760539",
        "Abstract": "Blockchain is a technology making the shared registry concept from distributed systems a reality for a number of application domains, from the cryptocurrency one to potentially any industrial system requiring decentralized, robust, trusted, and automated decision making in a multi-stakeholder situation. Nevertheless, the actual advantages in using blockchain instead of any other traditional solution (such as centralized databases) are not completely understood to date, or at least there is a strong need for a vademecum guiding designers toward the right decision about when to adopt blockchain or not, which kind of blockchain better meets use-case requirements, and how to use it. In this paper, we aim at providing the community with such a vademecum, while giving a general presentation of blockchain that goes beyond its usage in Bitcoin and surveying a selection of the vast literature that emerged in the last few years. We draw the key requirements and their evolution when passing from permissionless to permissioned blockchains, presenting the differences between proposed and experimented consensus mechanisms, and describing existing blockchain platforms.",
        "Published in": "IEEE Communications Surveys & Tutorials",
        "Date of Publication": "12 July 2019",
        "Page(s)": "3796 - 3838",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/COMST.2019.2928178",
        "DOI Link": "https://doi.org/10.1109/COMST.2019.2928178",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Lightweight and Attack-Proof Bidirectional Blockchain Paradigm for Internet of Things",
        "Authors": "Chenhao Xu; Youyang Qu; Tom H. Luan; Peter W. Eklund; Yong Xiang; Longxiang Gao; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9509292/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9509292",
        "Abstract": "Diverse technologies, such as machine learning and big data, have been driving the prosperity of the Internet of Things (IoT) and the ubiquitous proliferation of IoT devices. Consequently, it is natural that IoT becomes the driving force to meet the increasing demand for frictionless transactions. To secure transactions in IoT, blockchain is widely deployed since it can remove the necessity of a trusted central authority. However, the mainstream blockchain-based IoT payment platforms, dominated by Proof-of-Work (PoW) and Proof-of-Stake (PoS) consensus algorithms, face several major security and scalability challenges that result in system failures and financial loss. Among the three leading attacks in this scenario, double-spend attacks and long-range attacks threaten the tokens of blockchain users, while eclipse attacks target Denial of Service. To defeat these attacks, a novel bidirectional-linked blockchain (BLB) using chameleon hash functions is proposed, where bidirectional pointers are constructed between blocks. Furthermore, a new committee members auction (CMA) consensus algorithm is designed to improve the security and attack resistance of BLB while guaranteeing high scalability. In CMA, distributed blockchain nodes elect committee members through a verifiable random function. The smart contract uses Shamir’s secret-sharing scheme to distribute the trapdoor keys to committee members. To better investigate BLB’s resistance against double-spend attacks, an improved Nakamoto’s attack analysis is presented. In addition, a modified entropy metric is devised to measure eclipse attack resistance across different consensus algorithms. Extensive evaluation results show the superior resistance against attacks and demonstrate high scalability of BLB compared with current leading paradigms based on PoS and PoW.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "09 August 2021",
        "Page(s)": "4371 - 4384",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2021.3103275",
        "DOI Link": "https://doi.org/10.1109/JIOT.2021.3103275",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Blockchain-Based Model Migration Approach for Secure and Sustainable Federated Learning in IoT Systems",
        "Authors": "Cheng Zhang; Yang Xu; Haroon Elahi; Deyu Zhang; Yunlin Tan; Junxian Chen; Yaoxue Zhang; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9766205/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9766205",
        "Abstract": "Model migration can accelerate model convergence during federated learning on the Internet of Things (IoT) devices and reduce training costs by transferring feature extractors from fast to slow devices, which, in turn, enables sustainable computing. However, malicious or lazy devices may migrate the fake models or resist sharing models for their benefit, reducing the desired efficiency and reliability of a federated learning system. To this end, this work presents a blockchain-based model migration approach for resource-constrained IoT systems. The proposed approach aims to achieve secure model migration and speed up model training while minimizing computation cost. We first develop an incentive mechanism considering the economic benefits of fast devices, which breaks the Nash equilibrium established by lazy devices and encourages capable devices to train and share models. Second, we design a clustering-based algorithm for identifying malicious devices and preventing them from defrauding incentives. Third, we use blockchain to ensure trustworthiness in model migration and incentive processes. Blockchain records the interaction between the central server and IoT devices and runs the incentive algorithm without exposing the devices’ private data. Theoretical analysis and experimental results show that the proposed approach can accelerate federated learning rates, reduce model training computation costs to increase sustainability, and resist malicious attacks.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "02 May 2022",
        "Page(s)": "6574 - 6585",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2022.3171926",
        "DOI Link": "https://doi.org/10.1109/JIOT.2022.3171926",
        "Publisher": "IEEE"
    },
    {
        "Title": "Leveraging Blockchain to Enhance Digital Transformation in Small and Medium Enterprises: Challenges and a Proposed Framework",
        "Authors": "Hoai-Nam Nguyen; Hoang-Anh Pham; Nguyen Huynh-Tuong; Duc-Hiep Nguyen; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10538268/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10538268",
        "Abstract": "This paper presents a Blockchain-based framework for providing Blockchain services for purposes of stability in terms of consensus protocol infrastructure and governance mechanisms and accessible auxiliary services suitable for the vast majority of current business needs, including fundamental factors such as digital identity with autonomous identity, building solutions to ensure transaction privacy with zero-knowledge proofs, and other services related to digital assets. The proposed framework helps promote digital transformation for businesses, especially small and medium enterprises with limited resources and costs, to apply Blockchain technology to their business models, increasing competitive advantages and assisting the companies in focusing on business logic while still using Blockchain technology in their functions.",
        "Published in": "IEEE Access",
        "Date of Publication": "24 May 2024",
        "Page(s)": "74961 - 74978",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3405409",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3405409",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Distributed Efficient Blockchain Oracle Scheme for Internet of Things",
        "Authors": "Youquan Xian; Lianghaojie Zhou; Jianyong Jiang; Boyi Wang; Hao Huo; Peng Liu; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10475138/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10475138",
        "Abstract": "In recent years, blockchain has been widely applied in the Internet of Things (IoT). Blockchain oracle, as a bridge for data communication between blockchain and off-chain, has also received significant attention. However, the numerous and heterogeneous devices in the IoT pose great challenges to the efficiency and security of data acquisition for oracles. We find that the matching relationship between data sources and oracle nodes greatly affects the efficiency and service quality of the entire oracle system. To address these issues, this paper proposes a distributed and efficient oracle solution tailored for the IoT, enabling fast acquisition of real-time off-chain data. Specifically, we first design a distributed oracle architecture that combines both Trusted Execution Environment (TEE) devices and ordinary devices to improve system scalability, considering the heterogeneity of IoT devices. Secondly, based on the trusted node information provided by TEE, we determine the matching relationship between nodes and data sources, assigning appropriate nodes for tasks to enhance system efficiency. Through simulation experiments, our proposed solution has been shown to effectively improve the efficiency and service quality of the system, reducing the average response time by approximately 9.92% compared to conventional approaches.",
        "Published in": "IEICE Transactions on Communications",
        "Date of Publication": "18 March 2024",
        "Page(s)": "573 - 582",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.23919/transcom.2023EBP3156",
        "DOI Link": "https://doi.org/10.23919/transcom.2023EBP3156",
        "Publisher": "IEICE"
    },
    {
        "Title": "Scaling Blockchains: A Comprehensive Survey",
        "Authors": "Abdelatif Hafid; Abdelhakim Senhaji Hafid; Mustapha Samih; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9133427/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9133427",
        "Abstract": "Blockchain (e.g., Bitcoin and Ethereum) has drawn much attention and has been widely-deployed in recent years. However, blockchain scalability is emerging as a challenging issue. This paper outlines the existing solutions to blockchain scalability, which can be classified into two categories: first layer and second layer solutions. First layer solutions propose modifications to the blockchain (i.e., changing the blockchain structure, such as block size) while second layer solutions propose mechanisms that are implemented outside of the blockchain. In particular, we focus on sharding as a promising first layer solution to the scalability issue; the basic idea behind sharding is to divide the blockchain network into multiple committees, each processing a separate set of transactions. More specifically, (a) we propose a taxonomy based on committee formation and intra-committee consensus; and (b) we compare the main existing sharding-based blockchain protocols. We also present a performance-based comparative analysis (i.e., throughput and latency), of the advantages, and disadvantages in existing scalability solutions.",
        "Published in": "IEEE Access",
        "Date of Publication": "06 July 2020",
        "Page(s)": "125244 - 125262",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.3007251",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.3007251",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey of Decentralizing Applications via Blockchain: The 5G and Beyond Perspective",
        "Authors": "Kaifeng Yue; Yuanyuan Zhang; Yanru Chen; Yang Li; Lian Zhao; Chunming Rong; Liangyin Chen; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9548956/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9548956",
        "Abstract": "Trusted third parties (TTPs) are frequently used for serving as an authority to issue and verify transactions in applications. Although the TTP-based paradigm provides customers with convenience, it causes a whole set of inevitable problems such as security threats, privacy vulnerabilities, and censorship. The TTP-based paradigm is not suitable for all modern networks, e.g., 5G and beyond networks, which are been evolving to support ubiquitous, decentralized, and autonomous services. Driven by the vision of blockchain technologies, there has been a paradigm shift in applications, from TTP-based to decentralized-trust-based. Decentralized applications (DApps) with blockchains promise no trust on authorities, tackling the key challenges of security and privacy problems. A main thrust of blockchain research is to explore frameworks and paradigms for decentralizing applications, fostering a number of new designs ranging from network architectures to business models. Therefore, this paper provides a compact and concise survey on the state-of-the-art research of decentralizing applications with blockchain in the 5G and beyond perspective. We provide four burning 5G and beyond challenges and discuss five aspects of motivation for decentralizing applications with blockchain. Then, we define nine fundamental modules of blockchains and explain the potential influence of these modules on decentralization in depth. We also discuss the interrelation between decentralization and some desired blockchain properties. Particularly, we present the capabilities of blockchain for decentralizing applications through reviewing DApps for 5G and beyond. We clearly distinguish three blockchain paradigms and discuss how developers to make right choices for 5G and beyond. Finally, we highlight important learned lessons and open issues in applying blockchain for decentralizing applications. Lessons learned and open issues from this survey will facilitate the transformation of centralized applic...",
        "Published in": "IEEE Communications Surveys & Tutorials",
        "Date of Publication": "27 September 2021",
        "Page(s)": "2191 - 2217",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/COMST.2021.3115797",
        "DOI Link": "https://doi.org/10.1109/COMST.2021.3115797",
        "Publisher": "IEEE"
    },
    {
        "Title": "Securing Permissioned Blockchain-Based Systems: An Analysis on the Significance of Consensus Mechanisms",
        "Authors": "Norshakinah Md Nasir; Suhaidi Hassan; Khuzairi Mohd Zaini; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10685412/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10685412",
        "Abstract": "In the era of the Fourth Industrial Revolution (Industry 4.0), blockchain technology emerges as an innovative solution to address the challenges of digital-based business networks, such as traceability, transparency, trust, and data authenticity. This transformative technology has shown promise across diverse domains, including finance, healthcare, and supply chain, by enabling secure data transmission and trust establishment between entities. However, blockchain technology experiences an inherent trade-off issue between the core properties of security, decentralization, and scalability in its type of network. While permissionless blockchain excels in security and decentralization, such networks lack scalability and suitability for business transactions. Conversely, permissioned blockchains offer better performance, but are vulnerable to cyber-attacks due to weaknesses in consensus mechanisms. Therefore, this paper provides an analysis of blockchain technology, emphasizing the pivotal role of consensus mechanisms in ensuring security and system performance. In addition, it identifies practical threats, suggests countermeasures, and underscores the importance of resilient and secure consensus mechanisms. Furthermore, it compares and analyzes existing mechanisms for permissioned blockchains, discusses their limitations, and highlights the significance of ensuring system security and performance. Finally, it uncovers essential factors to consider when designing consensus mechanisms for specific blockchain-based applications, laying the foundation for future research in practical and secure permissioned blockchain applications.",
        "Published in": "IEEE Access",
        "Date of Publication": "23 September 2024",
        "Page(s)": "138211 - 138238",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3465869",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3465869",
        "Publisher": "IEEE"
    },
    {
        "Title": "Validating the Blockchain Benchmarking Framework Through Controlled Deployments of XRPL and Ethereum",
        "Authors": "Marios Touloupou; Klitos Christodoulou; Marinos Themistocleous; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10427547/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10427547",
        "Abstract": "In the evolving domain of blockchain, a critical challenge lies in the performance analysis of blockchains under controlled test conditions. This paper focuses on validating the Blockchain Benchmarking Framework (BBF), developed for the evaluation of blockchain protocols in a controlled environment. The BBF’s robustness and versatility are demonstrated through its application to the official Docker clients of Ripple’s XRP Ledger (XRPL) and Ethereum, deployed in private, local and controlled environments. These deployments are utilized to simulate network dynamics, transaction throughput, and resilience in a variety of scenarios. Our methodology encompasses tests ranging from standard operational conditions to adverse scenarios, including node failures and simulated double-spend attacks. These controlled environments are essential for evaluating the BBF’s efficacy in stress testing blockchain protocols and assessing their stability and robustness. The BBF’s ability to accurately capture and analyze performance characteristics is highlighted, providing insights into the operational mechanics, scalability, and resilience of these blockchain clients. The findings emphasize the BBF’s adaptability and effectiveness in managing different blockchain protocols, reaffirming its potential for broader application in pre-launch testing and analysis of blockchain performance. This study contributes to the understanding of how blockchain clients can be preliminarily assessed before mainnet deployment as well as to validate all the design decisions made by the protocol under different settings and synthetic scenarios.",
        "Published in": "IEEE Access",
        "Date of Publication": "08 February 2024",
        "Page(s)": "22264 - 22277",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3363833",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3363833",
        "Publisher": "IEEE"
    },
    {
        "Title": "Circuit Copyright Blockchain: Blockchain-Based Homomorphic Encryption for IP Circuit Protection",
        "Authors": "Wei Liang; Dafang Zhang; Xia Lei; Mingdong Tang; Kuan-Ching Li; Albert Y. Zomaya; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9091234/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9091234",
        "Abstract": "The fast development of Blockchain technology makes it widely applied in several fields of digital transactions, like e-government affairs and the protection of financial transactions. In this article, we propose a homomorphic encryption-based Blockchain for circuit copyright protection that effectively addresses the issues in the protection of circuit copyright transactions, such as low security of private data, low efficiency in transaction data storage, cooperation and supervision. First, we establish a homomorphic encryption-based mathematical model by utilizing Blockchain and intelligent contract, and next, the algorithms that include Blockchain generation, homomorphic chain encryption/decryption, and intelligent contract are designed. As the intelligent contract is correctly executed in Blockchain, a fully homomorphic encryption-based identity authentication protocol is tackled for Blockchain, given that it ensures the change operation of any third-party in Blockchain and realizes real-time verification. The system is apposite for circuit copyright protection in a blockchain network, due to the use of distributed identity authentication and real-time extensible storage improves the security and extensibility of blockchain-based circuit copyright protection. The experimental results show that the proposed algorithm has reduced the transmission cost and improved the efficiency of data storage and supervision. In addition, it is resilient to several common attacks (e.g., double-spending attacks), yet incurs low cost/overhead and has a higher level of security when compared to three other competing algorithms.",
        "Published in": "IEEE Transactions on Emerging Topics in Computing",
        "Date of Publication": "11 May 2020",
        "Page(s)": "1410 - 1420",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TETC.2020.2993032",
        "DOI Link": "https://doi.org/10.1109/TETC.2020.2993032",
        "Publisher": "IEEE"
    },
    {
        "Title": "Towards Interoperable Blockchains: A Survey on the Role of Smart Contracts in Blockchain Interoperability",
        "Authors": "Sajjad Khan; Muhammad Bilal Amin; Ahmad Taher Azar; Sheraz Aslam; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9519640/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9519640",
        "Abstract": "The slower than expected adoption rate of blockchain technology has highlighted that there are barriers due to the diversity of its applications and its users. To overcome this limitation and take full advantage of the novel technology, researchers from academia as well as industry are dedicated to find different solutions, where two or more blockchains can interact with each other. As a result, several interoperability solutions have presented themselves. To investigate the functionalities and underlying mechanisms of interoperable blockchain solutions, researchers have conducted several surveys by discussing the features and innovations of these methods. However, the existing surveys tend to focus on the architectural description of the interoperability solutions and completely overlook the most promising aspect of blockchain adaptability, namely the smart contract. This paper fills the gap by exploring the role of smart contracts in blockchain interoperability solutions. Our research has classified the existing interoperability solutions into three main categories: heterogeneous blockchains and homogeneous smart contracts, homogeneous blockchains and homogeneous smart contracts, heterogeneous blockchains, and heterogeneous smart contracts. To provide a systematic overview of the smart contracts used in blockchain interoperability, each category is further divided into subcategories by identifying the functionalities of the smart contract used. Based on our survey, a taxonomy is proposed to help classify the blockchain interoperability solutions. The interoperability solutions in each category are analyzed in-depth, and the results are presented in tabular format to illustrate the characteristics of the interoperability solutions in a meaningful way. Finally, a number of open issues and research directions are discussed to overcome the limitations and improve the performance of blockchain interoperability.",
        "Published in": "IEEE Access",
        "Date of Publication": "20 August 2021",
        "Page(s)": "116672 - 116691",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3106384",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3106384",
        "Publisher": "IEEE"
    },
    {
        "Title": "Mapping the Knowledge on Blockchain Technology in the Field of Business and Management: A Bibliometric Analysis",
        "Authors": "Jinglan Yang; Chaoqun Ma; Dengjia Li; Jianghuai Liu; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9786730/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9786730",
        "Abstract": "Blockchain technology is gaining momentum in business and management (B&M) field for its decentralization, automation, unalterability and traceability. Yet, despite such a wide range of applications, there is little literature that integrates the history and evolution of blockchain. To this end, this study combines science mapping and bibliometric analysis of 696 articles published between 2015 and 2021 obtained from the Web of Science Core Collection database. By drawing the reference co-citation map, bibliographic coupling map and co-word map with CiteSpace and VOSviewer tools, we identify the foundational themes, current status, and future research directions of blockchain literature in B&M. The results indicate that the blockchain research evolves from decentralized transaction and smart contract, and future research is focusing on the role of blockchain in financial risk management, organizational structure and the digital transformation of society.",
        "Published in": "IEEE Access",
        "Date of Publication": "02 June 2022",
        "Page(s)": "60585 - 60596",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3179714",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3179714",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Systematic Literature Review Toward a Blockchain Benchmarking Framework",
        "Authors": "Marios Touloupou; Marinos Themistocleous; Elias Iosif; Klitos Christodoulou; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9813702/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9813702",
        "Abstract": "Blockchain is a disruptive technology that focuses on the safe exchange of data between several distributed applications. Despite its widespread adoption, there are areas that require further research towards the understanding of their performance characteristics. In addition, consensus algorithms, a vital part of blockchain, require a more comprehensive understanding of their technical principles and characteristics. Along with the design of different types of consensus algorithms, several challenges, such as system scalability and power consumption, have been raised. Therefore, more comprehensive research is needed to investigate the degree to which consensus algorithms are built and how they perform. To this end, this study extends the body of knowledge and contributes towards the assessment of blockchain protocol performance. We present a comprehensive taxonomy of selected studies on blockchain performance, identifying similarities and differences while attempting to identify existing work on simulators and benchmarking frameworks that aim to explore the performance of blockchain-enabled consensus algorithms.",
        "Published in": "IEEE Access",
        "Date of Publication": "04 July 2022",
        "Page(s)": "70630 - 70644",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3188123",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3188123",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Proxy Re-Encryption Approach to Secure Data Sharing in the Internet of Things Based on Blockchain",
        "Authors": "Kwame Opuni-Boachie Obour Agyekum; Qi Xia; Emmanuel Boateng Sifah; Christian Nii Aflah Cobblah; Hu Xia; Jianbin Gao; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9442931/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9442931",
        "Abstract": "The evolution of the Internet of Things has seen data sharing as one of its most useful applications in cloud computing. As eye-catching as this technology has been, data security remains one of the obstacles it faces since the wrongful use of data leads to several damages. In this article, we propose a proxy re-encryption approach to secure data sharing in cloud environments. Data owners can outsource their encrypted data to the cloud using identity-based encryption, while proxy re-encryption construction will grant legitimate users access to the data. With the Internet of Things devices being resource-constrained, an edge device acts as a proxy server to handle intensive computations. Also, we make use of the features of information-centric networking to deliver cached content in the proxy effectively, thus improving the quality of service and making good use of the network bandwidth. Further, our system model is based on blockchain, a disruptive technology that enables decentralization in data sharing. It mitigates the bottlenecks in centralized systems and achieves fine-grained access control to data. The security analysis and evaluation of our scheme show the promise of our approach in ensuring data confidentiality, integrity, and security.",
        "Published in": "IEEE Systems Journal",
        "Date of Publication": "27 May 2021",
        "Page(s)": "1685 - 1696",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JSYST.2021.3076759",
        "DOI Link": "https://doi.org/10.1109/JSYST.2021.3076759",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain Meets Generative Behavior Steganography: A Novel Covert Communication Framework for Secure IoT Edge Computing",
        "Authors": "Yuanlong Cao; Junjie Li; Kailin Chao; Jianmao Xiao; Gang Lei; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10606209/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10606209",
        "Abstract": "The rapid development of Internet of things (IoT) and edge computing technologies has brought forth numerous possibilities for the intelligent and digital future. The frequent communication and interaction between devices inevitably generate a large amount of sensitive information. Deploying a blockchain network to store sensitive data is crucial for ensuring privacy and security. The openness and synchronicity of blockchain networks give rise to challenges such as transaction privacy and storage capacity issues, significantly impeding their development in the context of edge computing and IoT. This paper proposes a reliable fog computing service solution based on a blockchain fog architecture. This paper stores data files in the inter planetary file system (IPFS) and encrypts the file hash values used for retrieving data files with stream cipher encryption. It employs a steganographic transmission technique leveraging AlphaZero's Gomoku algorithm to discretely transmit the stream cipher key across the blockchain network without a carrier, thus achieving dual encryption. This approach aims to mitigate the storage burden on the blockchain network while ensuring the security of transaction data. Experimental results demonstrate that the model enhances the transmission capacity of confidential information from kilobytes (KB) to megabytes (MB) and exhibits high levels of covert and security features.",
        "Published in": "Chinese Journal of Electronics",
        "Date of Publication": "22 July 2024",
        "Page(s)": "886 - 898",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.23919/cje.2023.00.382",
        "DOI Link": "https://doi.org/10.23919/cje.2023.00.382",
        "Publisher": "CIE"
    },
    {
        "Title": "A Taxonomy for Characterizing Blockchain Systems",
        "Authors": "Fouzia E. Alzhrani; Kawther A. Saeedi; Liping Zhao; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9919811/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9919811",
        "Abstract": "Since its inception more than a decade ago, blockchain technology has been quickly adopted by a large number of sectors, including finance, healthcare, energy supply, and logistics, due to its numerous benefits, such as decentralization, persistency, anonymity and auditability. However, blockchain applications are intrinsically complex, as they are heterogeneous in nature and require cooperation and interoperation with non-blockchain systems. The complexity of the blockchain systems is further exacerbated by the lack of a clear understanding of their composition. This paper aims to bridge this knowledge gap by proposing a taxonomy for characterizing blockchain systems. The proposed taxonomy classifies a blockchain system into a hierarchy of components: At the top level, the system is organized into an external subsystem, an internal subsystem and an execution environment subsystem. These subsystems are then decomposed into eight fundamental components: Platform, Network, Distributed Ledger, Smart Contract, Consensus Protocol, Digital Wallet, Token, and Node. Each component is further divided into different aspects and each aspect is characterized by various features. This taxonomy thus provides a comprehensive understanding of the composition of a blockchain system, which can better inform software developers in their design and implementation of blockchain systems. The paper presents and illustrates the proposed taxonomy through some application scenarios and a case study.",
        "Published in": "IEEE Access",
        "Date of Publication": "14 October 2022",
        "Page(s)": "110568 - 110589",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3214837",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3214837",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain Mutability: Challenges and Proposed Solutions",
        "Authors": "Eugenia Politou; Fran Casino; Efthimios Alepis; Constantinos Patsakis; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8883080/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8883080",
        "Abstract": "Blockchain's evolution during the past decade is astonishing: from bitcoin to over 2.000 altcoins, and from decentralised electronic payments to transactions programmable by smart contracts and complex tokens governed by decentralised organisations. While the new generation of blockchain applications is still evolving, blockchain's technical characteristics are also advancing. Yet, immutability, a hitherto indisputable and highly advertised property according to which blockchain data cannot be edited nor deleted, remains the cornerstone of blockchain's security. Nevertheless, blockchain's immutability is being called into question lately in the light of the new erasing requirements imposed by the GDPR's “ Right to be Forgotten (RtbF) ” provision. As the RtbF obliges blockchain data to be editable in order restricted content redactions, modifications or deletions to be applied when requested, blockchains compliance with the regulation is indeed challenging, if not impracticable. Towards resolving this contradiction, various methods and techniques for mutable blockchains have been proposed to satisfy regulatory erasing requirements while preserving blockchains’ security. To this end, this work aims to provide a comprehensive review on the state-of-the-art research approaches, technical workarounds and advanced cryptographic techniques that have been put forward to resolve this conflict and to discuss their potentials, constraints and limitations when applied in the wild to either permissioned or permissionless blockchains.",
        "Published in": "IEEE Transactions on Emerging Topics in Computing",
        "Date of Publication": "25 October 2019",
        "Page(s)": "1972 - 1986",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TETC.2019.2949510",
        "DOI Link": "https://doi.org/10.1109/TETC.2019.2949510",
        "Publisher": "IEEE"
    },
    {
        "Title": "Aeolus: Distributed Execution of Permissioned Blockchain Transactions via State Sharding",
        "Authors": "Peilin Zheng; Quanqing Xu; Xiapu Luo; Zibin Zheng; Weilin Zheng; Xu Chen; Zhiyuan Zhou; Ying Yan; Hui Zhang; ; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9748986/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9748986",
        "Abstract": "Blockchain has attracted lots of attention in recent years. However, the performance of blockchain cannot meet the requirement of massive Internet of Things (IoT) devices. One of the important bottlenecks of blockchain is the limited computing resources on a single server while executing transactions. To address this issue, we propose Aeolus blockchain to achieve the distributed execution of blockchain transactions. There are two key challenges to achieving this for IoT blockchain: transaction structure and state consistency. Facing these challenges, we first propose a distributed blockchain transaction structure, which imports extra parameters to divide the transaction execution into different stages to enable distributed execution. Second, we propose distributed state update sharding, which equips each blockchain peer with its own master and shard servers. In this way, each blockchain peer can be considered as a cluster that distributes the transaction to shorten the processing time and reach the consensus finally. We implement Aeolus on Go-Ethereum to evaluate its feasibility, on a testbed including 132 cloud servers. Our system runs stably for more than 8 h under the workload of 190 000 000 real-world user transactions. Experimental results show the efficiency that Aeolus can achieve more than 100 000 transactions/s of blockchain transactions, which is 15.6 times the throughput of the original blockchain.",
        "Published in": "IEEE Transactions on Industrial Informatics",
        "Date of Publication": "04 April 2022",
        "Page(s)": "9227 - 9238",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TII.2022.3164433",
        "DOI Link": "https://doi.org/10.1109/TII.2022.3164433",
        "Publisher": "IEEE"
    },
    {
        "Title": "Optimized User-Friendly Transaction Time Management in the Blockchain Distributed Energy Market",
        "Authors": "Martin Onyeka Okoye; Hak-Man Kim; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9741778/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9741778",
        "Abstract": "The blockchain nexus with energy transactions in the distributed energy-trading arena successfully achieved a decentralized transaction and increased security. With the elimination of a third-party middle man, an electronic app is introduced to achieve decentralization and aid transactive communications. Observing the internet-of-things (IoT) intense protocols in the transactive communications amongst blockchain participants, however, leads to transaction time delay with associated uncertainty. This paper integrates the practical byzantine fault tolerance (pBFT) algorithm with the private Hyperledger Sawtooth blockchain network (P) to achieve a P-pBFT algorithm. The P-pBFT achieved a combined two-step transaction latency optimization (minimization) amongst the blockchain participants in the distributed energy generation (DEG) ecosystem. Through their combined feature extraction, further minimization is achieved by simulating the resulting transaction model derived from the integration. Subsequently, an optimization method is proposed to achieve the shortest transaction time given transaction constraints based on participants’ comfort. Thus, the ratio of node population to the transaction size and the choice of constraints can be regulated at the participants’ convenience to achieve minimum transaction time. Hence, the benefit of deciding the transaction time is achieved thereby eliminating the undesired characteristic uncertainty.",
        "Published in": "IEEE Access",
        "Date of Publication": "25 March 2022",
        "Page(s)": "34731 - 34742",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3162214",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3162214",
        "Publisher": "IEEE"
    },
    {
        "Title": "Towards Post-Quantum Blockchain: A Review on Blockchain Cryptography Resistant to Quantum Computing Attacks",
        "Authors": "Tiago M. Fernández-Caramès; Paula Fraga-Lamas; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8967098/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8967098",
        "Abstract": "Blockchain and other Distributed Ledger Technologies (DLTs) have evolved significantly in the last years and their use has been suggested for numerous applications due to their ability to provide transparency, redundancy and accountability. In the case of blockchain, such characteristics are provided through public-key cryptography and hash functions. However, the fast progress of quantum computing has opened the possibility of performing attacks based on Grover's and Shor's algorithms in the near future. Such algorithms threaten both public-key cryptography and hash functions, forcing to redesign blockchains to make use of cryptosystems that withstand quantum attacks, thus creating which are known as post-quantum, quantum-proof, quantum-safe or quantum-resistant cryptosystems. For such a purpose, this article first studies current state of the art on post-quantum cryptosystems and how they can be applied to blockchains and DLTs. Moreover, the most relevant post-quantum blockchain systems are studied, as well as their main challenges. Furthermore, extensive comparisons are provided on the characteristics and performance of the most promising post-quantum public-key encryption and digital signature schemes for blockchains. Thus, this article seeks to provide a broad view and useful guidelines on post-quantum blockchain security to future blockchain researchers and developers.",
        "Published in": "IEEE Access",
        "Date of Publication": "23 January 2020",
        "Page(s)": "21091 - 21116",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.2968985",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.2968985",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain for Cybersecurity in Smart Grid: A Comprehensive Survey",
        "Authors": "Peng Zhuang; Talha Zamir; Hao Liang; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9103603/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9103603",
        "Abstract": "Blockchain is an immutable type of distributed ledger that is capable of storing data without relying on a third party. Blockchain technology has attracted significant interest in research areas, including its application in the smart grid for cybersecurity. Although significant efforts have been devoted to utilizing blockchain in the smart grid for cybersecurity, there is a lack of comprehensive survey on blockchain in the smart grid for cybersecurity in both application and technological perspectives. To fill this gap, we conducted a comprehensive survey on blockchain for smart gird cybersecurity. This conducted survey presents the latest insights of ideas, architectures, and techniques of implementation that are relevant to blockchain's application in the smart grid for cybersecurity. This article aims at providing helpful guidance and reference for future research efforts specific to blockchain for cybersecurity in the smart grid.",
        "Published in": "IEEE Transactions on Industrial Informatics",
        "Date of Publication": "29 May 2020",
        "Page(s)": "3 - 19",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TII.2020.2998479",
        "DOI Link": "https://doi.org/10.1109/TII.2020.2998479",
        "Publisher": "IEEE"
    },
    {
        "Title": "Focus on Blockchain: A Comprehensive Survey on Academic and Application",
        "Authors": "Yijun Zou; Ting Meng; Peng Zhang; Wenzhen Zhang; Huiyang Li; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9220919/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9220919",
        "Abstract": "As a decentralized distributed ledger, blockchain has developed rapidly since its birth and has been highly valued by governments, academia, and industry. Start in the financial field, blockchain technology has been rapidly applied to various fields such as the Internet of Things, supply chain, and healthcare. Blockchain technology has made sufficient development and innovation, but it also faces many challenges, such as security, scalability, and waste of resources. This paper starts with the development history of blockchain and combines the characteristics and technical principles of it to analyze the current academic research status and application scenarios. Meanwhile, this paper analyzes the existing outstanding blockchain projects and elaborates on their key advantages and current challenges. With discussing the ongoing development trend of blockchain, the development direction, and the research trend of blockchain in the future, this paper provides a useful reference for related research.",
        "Published in": "IEEE Access",
        "Date of Publication": "12 October 2020",
        "Page(s)": "187182 - 187201",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.3030491",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.3030491",
        "Publisher": "IEEE"
    },
    {
        "Title": "Novel and Secure Blockchain Framework for Health Applications in IoT",
        "Authors": "Marah R. Bataineh; Wail Mardini; Yaser M. Khamayseh; Muneer Masadeh Bani Yassein; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9698054/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9698054",
        "Abstract": "Internet of Things (IoT) has grown increasingly in the past decade. This growth brings up several challenging issues for a successful continuous operation of IoT applications. Some of these challenges that need to be taken care of are resource constraints, central server overload, and the risk of illegal use of private data. On the other side, Blockchain technology is increasingly popular and has gained huge success in cryptocurrencies. It offers numerous vital qualities such as a technique for consensus, peer communications, confidence-building without a trustworthy third party, and a transaction controlled by conditions and functions using the intelligent contract technique. Blockchain is an excellent candidate to establish a decentralized, autonomous IoT system addressing the above issues. This study proposes an IoT-Blockchain integration architecture using an Ethereum Blockchain infrastructure within a rich-thin client IoT approach to address the challenges created by the limited IoT resources while implementing the Blockchain mining technique in IoT systems. The architecture depends on load distribution between the resources. Limited resource devices are the thin-clients, while the higher resource devices are assigned as rich-clients. Both clients can access the blockchain and collect the data, but rich-client can only execute the mining process. In addition, we implement a healthcare system based on the proposed architecture in which surgical process management is carried out. We also prove our solution’s efficiency by testing and comparing the architecture against other well-known IoT-based blockchain architectures. The obtained results show that proposed blockchain-IoT architecture is suited for many IoT applications while avoiding difficulties created by IoT devices’ limitations.",
        "Published in": "IEEE Access",
        "Date of Publication": "31 January 2022",
        "Page(s)": "14914 - 14926",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3147795",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3147795",
        "Publisher": "IEEE"
    },
    {
        "Title": "Interoperability in Blockchain: A Survey",
        "Authors": "Kunpeng Ren; Nhut-Minh Ho; Dumitrel Loghin; Thanh-Toan Nguyen; Beng Chin Ooi; Quang-Trung Ta; Feida Zhu; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10123097/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10123097",
        "Abstract": "This paper presents a systematic and comprehensive survey on blockchain interoperability, where interoperability is defined as the ability of blockchains to flexibly transfer assets, share data, and invoke smart contracts across a mix of public, private, and consortium blockchains without any changes to the underlying blockchain systems. Analyzing the vast landscape of both research papers and industry projects, we classify the existing works into five categories, namely, (1) sidechains, (2) notary schemes, (3) hashed time lock contracts (HTLC), (4) relays, and (5) blockchain agnostic protocols. We analyze the existing works under a taxonomy that consists of system and safety characteristics, such as decentralization, direction of communication, locking mechanism, verification mechanism, trust, safety, liveness, and atomicity. Different from other surveys, we are the first to evaluate the performance of some representative interoperability approaches between Bitcoin and Ethereum covering sidechains, notary schemes, and HTLCs. Even though the performance of cross-chain transactions is low (typically fewer than 10 transactions per second), the main reason is the underlying blockchain (e.g., Bitcoin and Ethereum) and not the interoperability approach. Finally, we discuss existing challenges and possible research directions in blockchain interoperability. For example, we identify challenges in interoperability across permissioned and permissionless blockchains, in interacting with scripting blockchains, in security and privacy.",
        "Published in": "IEEE Transactions on Knowledge and Data Engineering",
        "Date of Publication": "11 May 2023",
        "Page(s)": "12750 - 12769",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TKDE.2023.3275220",
        "DOI Link": "https://doi.org/10.1109/TKDE.2023.3275220",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey on Consensus Algorithms in Blockchain-Based Applications: Architecture, Taxonomy, and Operational Issues",
        "Authors": "Saminur Islam; Mohammad Jaminur Islam; Mahmud Hossain; Shahid Noor; Kyung-Sup Kwak; S. M. Riazul Islam; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10101789/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10101789",
        "Abstract": "Recently, Blockchain-based applications have become immensely popular because of limited reliance on a single entity, unlike a centralized system. However, reaching a consensus among blockchain networks is a challenging and vital aspect of blockchain-based applications. There are various types of blockchain networks for different kinds of application scenarios. Among all of them, the consensus algorithm is the most crucial part of reaching an agreement in the complex blockchain network. Over the years, researchers have focused on dealing with the challenges like distributed computing, storage, transaction speed, security, validity, interoperability, and many more. However, only some of them are appropriate for all domains. Therefore, this paper presents an extensive study of different types of consensus protocols used in existing blockchain solutions with the strength and limitations of each algorithm. We also provide an inherent comparison among different algorithms to understand consensus protocol selection better. Moreover, we investigate operational and interoperability issues in existing blockchain-based applications to understand challenges and provide recommendations for future developers.",
        "Published in": "IEEE Access",
        "Date of Publication": "13 April 2023",
        "Page(s)": "39066 - 39082",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2023.3267047",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2023.3267047",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey of Blockchain Based Systems: Scalability Issues and Solutions, Applications and Future Challenges",
        "Authors": "Turki Ali Alghamdi; Rabiya Khalid; Nadeem Javaid; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10546932/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10546932",
        "Abstract": "Blockchain technology originated alongside Bitcoin as a novel method of conducting financial transactions. It has garnered significant attention from both industry and academia in recent years, emerging as a prominent area of research. It is a decentralized record-keeping system that holds transactional information. The scale of a blockchain network expands according to the growth in the number of nodes and transactions, resulting in issues related to storage capacity, data processing speed, and time delay. These issues have a direct impact on the scalability of a blockchain network. Currently, scalability is one of the prominent concerns in the field of blockchain technology and an active research area. This study conducts a comprehensive survey of the scalability challenges faced by blockchain technology in several sectors. It also examines potential solutions based on consensus mechanisms, smart contracts and directed acyclic graph (DAG). It is observed that the proposed scalability solutions target enhancing system throughput, reducing costs, and improving blockchain efficiency. Therefore, we examine, compare, and evaluate the literature using these specific criteria. Moreover, a survey of existing blockchain based survey papers is presented. A comparative analysis of these survey papers is presented along with their recency score, which is determined by the number of recent publications reviewed in a survey paper. By “recent,” we mean the current year (or the publication year of a survey paper) and the three years prior to it. Additionally, this paper offers an elaborate discussion on the forthcoming open research challenges and applications of blockchain.",
        "Published in": "IEEE Access",
        "Date of Publication": "03 June 2024",
        "Page(s)": "79626 - 79651",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3408868",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3408868",
        "Publisher": "IEEE"
    },
    {
        "Title": "MSTDB: A Hybrid Storage-Empowered Scalable Semantic Blockchain Database",
        "Authors": "Enyuan Zhou; Zicong Hong; Yang Xiao; Dongxiao Zhao; Qingqi Pei; Song Guo; Rajendra Akerkar; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9942353/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9942353",
        "Abstract": "Blockchain has been regarded as a trusted carrier for distributed data storage. With large volumes of valuable data stored on blockchain, data query has become a major requirement. However, the existing blockchains do not provide efficient query functionality because of their deep-rooted chain structure. Blockchain database is a new direction that constructs index on top of blockchain to provide rich query functionalities. The existing works are either insecure because the query process separates from the blockchain consensus, or inscalable because all the data needs to be stored in the block. In this paper, we propose a novel semantic blockchain database called MSTDB. We design a hybrid on/off chain blockchain storage architecture in which the majority of blockchain storage is offloaded to the off-chain storage and a novel index structure named Merkle Semantic Trie (MST) is designed to be a secure and semantic bridge between on- and off-chain. Based on MST, MSTDB provides a variety of semantic query functions including multi-keyword query, range query, Top-K query, and cross-chain query. To improve the performance further, we design some index compression and query preprocessing techniques for MSTDB. Extensive experiments demonstrate the effectiveness and efficiency of our blockchain database.",
        "Published in": "IEEE Transactions on Knowledge and Data Engineering",
        "Date of Publication": "08 November 2022",
        "Page(s)": "8228 - 8244",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TKDE.2022.3220522",
        "DOI Link": "https://doi.org/10.1109/TKDE.2022.3220522",
        "Publisher": "IEEE"
    },
    {
        "Title": "Research Methodologies to Support the Development of Blockchain Standards",
        "Authors": "",
        "HTML Link": "https://ieeexplore.ieee.org/document/10258109/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10258109",
        "Abstract": "This paper dissects the research methodologies implemented by the Research Team for the Smart Contracts Working Group (TC-307/IT-041 Blockchain and Distributed Ledger Technologies) in developing standards to inform best practice in the design and use of blockchain and distributed ledger technologies. In doing so, it explores the origins of blockchain standardisation and outlines the high-level methodology for conducting and delivering research in this rapidly evolving space. Using three case studies, this paper shows how different tasks give rise to, and benefit from, specialised methodologies. These case studies also highlight a number of challenges and opportunities, and demonstrate how a flexible research approach can increase efficiency and generate findings that are likely to influence blockchain standardisation at a global level. Case Study 1 describes our research into the legal status of smart contracts and the challenge of delivering clear findings about unclear subject matter. Case Study 2, which involved examining the sufficiency of existing regulatory frameworks in the supply chain and trade facilitation context, illustrates how rigid formatting specifications can impact the content of findings. In contrast, Case Study 3 concerns a project to incorporate the United Nations Sustainable Development Goals into new and existing Standards and shows how researchers' knowledge can be harnessed as a valuable source of information in its own right. Finally, this paper extrapolates practical lessons for researchers who are interested in developing standards for emerging technologies, or simply undertaking much needed research into this area.",
        "Published in": "Journal of ICT Standardization",
        "Date of Publication": "2019",
        "Page(s)": "249 - 268",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.13052/jicts2245-800X.734",
        "DOI Link": "https://doi.org/10.13052/jicts2245-800X.734",
        "Publisher": "River Publishers"
    },
    {
        "Title": "Research Perspectives and Challenges of Blockchain for Data-Intensive and Resource-Constrained Devices",
        "Authors": "Muhammad Imran; Bin Yao; Waqas Ali; Adnan Akhunzada; Muhammad Kashif Azhar; Muhammad Junaid; Uzair Iqbal; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9741442/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9741442",
        "Abstract": "Blockchain technology in recent years has become potentially pervasive in the cryptocurrency market, thus providing tamper-proof security to decentralized transaction management systems. Structurally, the design foundation is an ideal advancement of the distributed ledger technology that maintains a set of global states across nodes. As technology expands with a higher trend towards mobile computing, the development of new applications demands understanding the current progression, especially concerning performance, data management, and storage prospects. Here, we report the principle design structure of the blockchain technology combined with the state of the arts, thus characterizing their original topological contexts. We depart from the fundamental concepts of the technology and analyze performance of the Ethereum blockchain on two devices having different computing power. Our presentation is tailored to provide a systematic review of the technology, thus facilitating their possible adoption into the new application domains like the Internet of Things (IoT). Further, we developed Debug-Bench, the first VSCode (Visual Studio Code) extension that enables benchmarking and profiling of the blockchain applications. Finally, we demonstrate several critical challenges concerning the design space of the current blockchain platforms for their implementation over resource-constrained devices.",
        "Published in": "IEEE Access",
        "Date of Publication": "24 March 2022",
        "Page(s)": "38104 - 38122",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3162096",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3162096",
        "Publisher": "IEEE"
    },
    {
        "Title": "High-Efficiency Blockchain-Based Supply Chain Traceability",
        "Authors": "Hanqing Wu; Shan Jiang; Jiannong Cao; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10050199/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10050199",
        "Abstract": "Supply chain traceability refers to product tracking from the source to customers, demanding transparency, authenticity, and high efficiency. In recent years, blockchain has been widely adopted in supply chain traceability to provide transparency and authenticity, while the efficiency issue is understudied. In practice, as the numerous product records accumulate, the time- and storage- efficiencies will decrease remarkably. To the best of our knowledge, this paper is the first work studying the efficiency issue in blockchain-based supply chain traceability. Compared to the traditional method, which searches the records stored in a single chunk sequentially, we replicate the records in multiple chunks and employ parallel search to boost the time efficiency. However, allocating the record searching primitives to the chunks with maximized parallelization ratio is challenging. To this end, we model the records and chunks as a bipartite graph and solve the allocation problem using a maximum matching algorithm. The experimental results indicate that the time overhead can be reduced by up to 85.1% with affordable storage overhead.",
        "Published in": "IEEE Transactions on Intelligent Transportation Systems",
        "Date of Publication": "22 February 2023",
        "Page(s)": "3748 - 3758",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TITS.2022.3205445",
        "DOI Link": "https://doi.org/10.1109/TITS.2022.3205445",
        "Publisher": "IEEE"
    },
    {
        "Title": "On Consortium Blockchain Consistency: A Queueing Network Model Approach",
        "Authors": "Tianhui Meng; Yubin Zhao; Katinka Wolter; Cheng-Zhong Xu; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9316952/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9316952",
        "Abstract": "Analyzing blockchain protocols is a notoriously difficult task due to the underlying large scale distributed networks. To address this problem, stochastic model-based approaches are often utilized. However, the abstract models in prior work turn out not to be adoptable to consortium blockchains as the consensus of such a blockchain often consists of multiple processes. To address the lack of efficient analysis tools, we propose a queueing network-based method for analyzing consistency properties of consortium blockchain protocols in this article. Our method provides a way to evaluate the performance of the main stages in blockchain consensus. We apply our framework to the Hyperledger Fabric system and recover key properties of the blockchain network. Using our method, we analyze the security properties of the ordering mechanism and the impact of delaying endorsement messages in consortium blockchain protocols. Then an upper bound is derived of the damage an attacker could cause who is capable of delaying the honest players' messages. Based on the proposed method, we employ analytical derivations to investigate both the security and performance features, and corroborate close agreement with measurements on a wide-area network testbed running the Hyperledger Fabric blockchain. With the proposed method, designers of future blockchains can provide a more rigorous analysis of their consortium blockchain schemes.",
        "Published in": "IEEE Transactions on Parallel and Distributed Systems",
        "Date of Publication": "08 January 2021",
        "Page(s)": "1369 - 1382",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TPDS.2021.3049915",
        "DOI Link": "https://doi.org/10.1109/TPDS.2021.3049915",
        "Publisher": "IEEE"
    },
    {
        "Title": "Time Efficient Hash Key Generation for Blockchain Enabled Framework",
        "Authors": "Shyam Kumar Sinha; Debarka Mukhopadhyay; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10714326/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10714326",
        "Abstract": "Blockchain, in general, helps organizations to improve the transparency and governance by removing its shortfalls and building better control overall. Blockchain network, public or private, is a competent technology when used in order with an optimized hashing technique. In a blockchain network, one of the common issues is performance while registering any transactions. Blockchain must need to do some preliminary checks to avoid double-spending before registering the transaction. Here, we implement one of the optimization aspects of the hashing technique, which can contribute to the blockchain mining processes and save time. It enables the blockchain to perform efficiently and reliably. In addition, we examine how well different hashing algorithms perform when added to the blockchain network’s processes. In this research, we analyze several hashing techniques that are employed in the blockchain and are also applied in the supply chain domain due to their efficacy in mitigating past attacks. Our proposed hashing technique allows a blockchain network to improve security and its overall processes. The proposed hashing technique achieves approx. 10-90% performance gain improvements over other existing technique. Our proposed hashing technique allows a blockchain network to improve security and its overall processes. The study also examines how the supply chain management contributes in increasing of overall lead time where process optimization or technological enhancement plays key roles in minimizing the time of some or all the processes. Lead time is one of the common issues of supply chain which impacts on overall order delivery time. We address on how the conjunction of blockchain with optimized hashing technique can address supply chain lead time issues.",
        "Published in": "IEEE Access",
        "Date of Publication": "11 October 2024",
        "Page(s)": "155867 - 155884",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3478845",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3478845",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain as a Cyber Defense: Opportunities, Applications, and Challenges",
        "Authors": "Suhyeon Lee; Seungjoo Kim; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9654201/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9654201",
        "Abstract": "Targets of cyber crime are not exclusive to the private sector. Successful cyber attacks on nation-states have proved that cyber threats can jeopardize significant national interests. In response, nation-states have begun to handle cyber threats at the national defense level, which is titled ‘cyber defense.’ The cyber defense sector is related to national security, therefore requires robust security technology. Contrary to normal systems, blockchain provides strong security properties without a centralized control entity, and as such its application in the cyber defense field is under the spotlight. In this paper, we present opportunities blockchain provides for cyber defense, research and national projects, and limitations. We constructed a survey of government documents, interviews, related news, technical reports, and research papers from 2016 to 2021. As a result, our research contributes to reducing the gap in blockchain for cyber defense by systematically conducting research and analysis. In our research, we found that not only research but also government-led plans are actively promoting blockchain, which demonstrates that blockchain will play a remarkable role in cyber defense. This paper concludes with suggestions for future research in aspects of the blockchain technology, evaluation, and survey.",
        "Published in": "IEEE Access",
        "Date of Publication": "16 December 2021",
        "Page(s)": "2602 - 2618",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3136328",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3136328",
        "Publisher": "IEEE"
    },
    {
        "Title": "An Efficient Multiparty Payment Protocol for IoT Micro-Payments",
        "Authors": "Jinchun He; Wangjie Qiu; Shengda Zhuo; Minghui Xu; Qinnan Zhang; Zehui Xiong; Zhiming Zheng; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10578054/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10578054",
        "Abstract": "The blockchain can offer a dependable and secure platform for Internet of Things (IoT) transactions with its distributed and secure network architecture. Unfortunately, it faces challenges, such as limited throughput, excessive computational costs, and high-transaction fees. Off-chain scaling protocols are used to address the scalability of blockchain for their outstanding performance and efficiency. To mitigate the high-cost interactions with blockchain, previous studies only considered moving transactions of payment hubs (PHs) off-chain, utilizing off-chain operators to aggregate multiple transactions. However, existing PHs overly rely on central operators for system maintenance, greatly increasing the risk of central operator failure (COF). Previous solutions allowed operators to submit unsettled state commitments (USCs) to the blockchain and overlooked the pessimistic scenario that could lead to state rollbacks. To address these issues, this article proposes an efficient multiparty payment protocol (HyperPay), aimed at utilizing the off-chain scaling technique to enhance transaction throughput and reduce on-chain cost. Specifically, we first propose a novel off-chain committee and collateral-based verifiable random leader election (C-VRE) to elect leaders fairly, thus mitigating the COF problem. Additionally, we design a new state validation mechanism and one-step fraud challenge (OSFC), enabling verifiers to directly construct fraud proofs and challenges on-chain, thereby preventing leaders from submitting USC. Our evaluation indicates that HyperPay reduces on-chain costs of challenge by 80% and boosts peak throughput by a factor of 10X-283X. A comprehensive theoretical analysis and experimental results substantiate the security and effectiveness of our proposed approach.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "01 July 2024",
        "Page(s)": "32854 - 32867",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2024.3421245",
        "DOI Link": "https://doi.org/10.1109/JIOT.2024.3421245",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey and Comparison of Post-Quantum and Quantum Blockchains",
        "Authors": "Zebo Yang; Haneen Alfauri; Behrooz Farkiani; Raj Jain; Roberto Di Pietro; Aiman Erbad; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10288193/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10288193",
        "Abstract": "Blockchains have gained substantial attention from academia and industry for their ability to facilitate decentralized trust and communications. However, the rapid progress of quantum computing poses a significant threat to the security of existing blockchain technologies. Notably, the emergence of Shor’s and Grover’s algorithms raises concerns regarding the compromise of the cryptographic systems underlying blockchains. Consequently, it is essential to develop methods that reinforce blockchain technology against quantum attacks. In response to this challenge, two distinct approaches have been proposed. The first approach involves post-quantum blockchains, which aim to utilize classical cryptographic algorithms resilient to quantum attacks. The second approach explores quantum blockchains, which leverage the power of quantum computers and networks to rebuild the foundations of blockchains. This paper aims to provide a comprehensive overview and comparison of post-quantum and quantum blockchains while exploring open questions and remaining challenges in these domains. It offers an in-depth introduction, examines differences in blockchain structure, security, privacy, and other key factors, and concludes by discussing current research trends.",
        "Published in": "IEEE Communications Surveys & Tutorials",
        "Date of Publication": "19 October 2023",
        "Page(s)": "967 - 1002",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/COMST.2023.3325761",
        "DOI Link": "https://doi.org/10.1109/COMST.2023.3325761",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain-Based Spectrum Management Architecture and Trading Mechanism Design for Space-Air-Ground Integrated Network",
        "Authors": "Weihan Wang; Youping Zhao; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10229507/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10229507",
        "Abstract": "In this letter, a layered multi-chain spectrum blockchain architecture is proposed for Space-Air-Ground Integrated Network (SAGIN) to significantly reduce system overhead and aggregated interference. Considering the dynamic characteristics of SAGIN, nodes can make hand off between different blockchains based on the interference conflict graph to maintain aggregated interference below the threshold. To further improve spectrum utilization while avoiding harmful interference caused by spectrum trading in SAGIN, a spectrum trading mechanism is proposed, which jointly considers spectrum pricing, deployment location, and transmit power optimization. Simulation results verify the effectiveness of the proposed spectrum blockchain architecture and trading mechanism.",
        "Published in": "IEEE Communications Letters",
        "Date of Publication": "24 August 2023",
        "Page(s)": "2692 - 2696",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/LCOMM.2023.3308097",
        "DOI Link": "https://doi.org/10.1109/LCOMM.2023.3308097",
        "Publisher": "IEEE"
    },
    {
        "Title": "Scalability and Security of Blockchain-Empowered Metaverse: A Survey",
        "Authors": "Huawei Huang; Zhaokang Yin; Qinglin Yang; Taotao Li; Xiaofei Luo; Lu Zhou; Zibin Zheng; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10695094/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10695094",
        "Abstract": "Metaverse brings unlimited space and tremendous potential since it is an integrated application of multiple fundamental technologies such as artificial intelligence, blockchain, networking, Internet of Things, and interactivity. During those building blocks of metaverse, blockchain is a type of technology operated by a group of individual participants and known for its immutability feature. The massive adoption of blockchain has been severely prevented by various security and scalability issues in blockchain-based applications due to the inherent characteristics of this technology. To accelerate the massive adoption of blockchain, many previous studies have been carried out to address the security and scalability issues. This article reviews blockchain-related publications collected from four major security conferences (i.e., NDSS, CCS, S&P, and USENIX Security) published in the past three years. Through this overview, we disclose the security and scalability issues of mainstream blockchains such as Bitcoin and Ethereum. Our study aims to help researchers better understand the bottleneck of blockchain-empowered metaverse, and how to address user requirements for security and scalability from the perspective of blockchains.",
        "Published in": "IEEE Open Journal of the Computer Society",
        "Date of Publication": "26 September 2024",
        "Page(s)": "648 - 659",
        "Electronic ISSN": "2644-1268",
        "PubMed ID": "",
        "DOI": "10.1109/OJCS.2024.3468445",
        "DOI Link": "https://doi.org/10.1109/OJCS.2024.3468445",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Blockchain-Based Approach for the Creation of Digital Twins",
        "Authors": "Haya R. Hasan; Khaled Salah; Raja Jayaraman; Mohammed Omar; Ibrar Yaqoob; Saša Pesic; Todd Taylor; Dragan Boscovic; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9001017/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9001017",
        "Abstract": "The rapid advancements in computing, storage, communications, and networking technologies have enabled the creation of Digital Twins (DTs). A DT is a digital representation of a real-world physical component, product, or equipment. A DT can be used for 3-D design, testing, simulation, and prototyping prior to the manufacturing of the physical component. Once a physical component is in operation, a DT can be used for configuration, monitoring, diagnostics, and prognostics. It is expected that DTs will gain significant attention in the foreseeable future, and will play a key role in Industry 4.0. However, today's approaches, systems, and technologies leveraged for the creation of DTs are mostly centralized and fall short of providing trusted data provenance, audit, and traceability. Also, data related to transactions, logs, and history are not secure or tamper-proof. In this paper, we propose a blockchain-based creation process of DTs to guarantee secure and trusted traceability, accessibility, and immutability of transactions, logs, and data provenance. Our proposed approach uses smart contracts to govern and track transactions initiated by participants involved in the creation of DTs. Our approach also employs decentralized storage of interplanetary file systems to store and share DTs data. Moreover, we present details on our system design and architecture, implementation, and algorithms. Furthermore, we provide security and cost analysis, and show how our approach fulfills the requirements of DTs process creation. We make the smart contract code for creating DTs publicly available on Github.",
        "Published in": "IEEE Access",
        "Date of Publication": "18 February 2020",
        "Page(s)": "34113 - 34126",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.2974810",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.2974810",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Trustworthy and Consistent Blockchain Oracle Scheme for Industrial Internet of Things",
        "Authors": "Peng Liu; Youquan Xian; Chuanjian Yao; Peng Wang; Li-e Wang; Xianxian Li; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10529200/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10529200",
        "Abstract": "A blockchain provides decentralization and trustlessness features for the Industrial Internet of Things (IIoT), which expands the application scenarios of IIoT. To address the problem that blockchains cannot actively obtain off-chain data, the blockchain oracle is proposed as a bridge between the blockchain and external data. However, the existing oracle schemes make it difficult to solve the problem of low quality of service caused by frequent data changes and heterogeneous devices in IIoT, and the current oracle node selection schemes are difficult to balance security and quality of service. To tackle these problems, this paper proposes a secure and reliable oracle scheme that can obtain high-quality off-chain data. Specifically, we first design an oracle node selection algorithm based on a Verifiable Random Function (VRF) and reputation mechanism to securely select high-quality nodes. Second, we propose a data filtering algorithm based on a sliding window to further improve the consistency of the collected data. We verify the security of the proposed scheme through security analysis. The experimental results show that the proposed scheme can effectively select high-quality nodes, reduce data differences, and improve the quality of service of the oracle. In the oracle network with malicious nodes accounting for 10%, the data accuracy rate is increased by about 4%, and the data variance is reduced by about 45% on average.",
        "Published in": "IEEE Transactions on Network and Service Management",
        "Date of Publication": "10 May 2024",
        "Page(s)": "5135 - 5148",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TNSM.2024.3399837",
        "DOI Link": "https://doi.org/10.1109/TNSM.2024.3399837",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Blockchain-Based Multi-Cloud Storage Data Auditing Scheme to Locate Faults",
        "Authors": "Cheng Zhang; Yang Xu; Yupeng Hu; Jiajing Wu; Ju Ren; Yaoxue Zhang; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9350231/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9350231",
        "Abstract": "Network storage services have benefited countless users worldwide due to the notable features of convenience, economy and high availability. Since a single service provider is not always reliable enough, more complex multi-cloud storage systems are developed for mitigating the data corruption risk. While a data auditing scheme is still needed in multi-cloud storage to help users confirm the integrity of their outsourced data. Unfortunately, most of the corresponding schemes rely on trusted institutions such as the centralized third-party auditor (TPA) and the cloud service organizer, and it is difficult to identify malicious service providers after service disputes. Therefore, we present a blockchain-based multi-cloud storage data auditing scheme to protect data integrity and accurately arbitrate service disputes. We not only introduce the blockchain to record the interactions among users, service providers, and organizers in data auditing process as evidence, but also employ the smart contract to detect service dispute, so as to enforce the untrusted organizer to honestly identify malicious service providers. We also use the blockchain network and homomorphic verifiable tags to achieve the low-cost batch verification without TPA. Theoretical analyses and experiments reveal that the scheme is effective in multi-cloud environments and the cost is acceptable.",
        "Published in": "IEEE Transactions on Cloud Computing",
        "Date of Publication": "08 February 2021",
        "Page(s)": "2252 - 2263",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TCC.2021.3057771",
        "DOI Link": "https://doi.org/10.1109/TCC.2021.3057771",
        "Publisher": "IEEE"
    },
    {
        "Title": "DDoS Mitigation in IoT Using Machine Learning and Blockchain Integration",
        "Authors": "Ammar Ibrahim El Sayed; Mahmoud Abdelaziz; Mohamed Hussein; Ashraf D. Elbayoumy; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10472588/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10472588",
        "Abstract": "The Internet of Things (IoT) has brought about flexible data management and monitoring, but it is increasingly vulnerable to distributed denial-of-service (DDoS) attacks. To counter these threats and bolster IoT device trust and computational capacity, we propose an innovative solution by integrating machine learning (ML) techniques with blockchain as a supporting framework. Analyzing IoT traffic datasets, we reveal the presence of DDoS attacks, highlighting the need for robust defenses. After evaluating multiple ML models, we choose the most effective one and integrate it with blockchain for enhanced detection and mitigation of DDoS threats, reinforcing IoT network security. This approach enhances device resilience, presenting a promising contribution to the secure IoT landscape.",
        "Published in": "IEEE Networking Letters",
        "Date of Publication": "18 March 2024",
        "Page(s)": "152 - 155",
        "Electronic ISSN": "2576-3156",
        "PubMed ID": "",
        "DOI": "10.1109/LNET.2024.3377355",
        "DOI Link": "https://doi.org/10.1109/LNET.2024.3377355",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain-Based IoT Model and Experimental Platform Design in the Defence Supply Chain",
        "Authors": "Roberto Cerchione; Piera Centobelli; Antimo Angelino; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10026873/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10026873",
        "Abstract": "This article aims to design, implement, and test a blockchain-based Internet of Things (IoT) platform model for the defence industry that enables the various supply chain (SC) actors to manage transactions and information in a transparent, secure, and traceable manner, while also fostering multilateral collaboration in the supply network. The platform was designed using a private and authorized model in the SC of MBDA Italy, part of MBDA—European leader in missile industry. Blockchain technology can facilitate the decentralization and automation of SC activities. Throughput, latency, infrastructure, interoperability, onboarding, and maintenance costs, data storage costs, waste of resources, block size restrictions, and the definition of smart contracts are the primary challenges and benefits that have influenced the design of a private permissioned blockchain. Managerial implications on the necessity to integrate the supply blockchain platform into other systems (e.g., finance, insurance, and social domains) are explored to provide recommendations for the development of a more integrated digital industrial ecosystem.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "27 January 2023",
        "Page(s)": "22033 - 22039",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2023.3240288",
        "DOI Link": "https://doi.org/10.1109/JIOT.2023.3240288",
        "Publisher": "IEEE"
    },
    {
        "Title": "SC-CAAC: A Smart-Contract-Based Context-Aware Access Control Scheme for Blockchain-Enabled IoT Systems",
        "Authors": "Mpyana Mwamba Merlec; Hoh Peter In; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10454577/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10454577",
        "Abstract": "Integrating blockchain technology with the Internet of Things (IoT) facilitates seamless interaction between IoT devices and systems to securely share, access, and exchange data. However, ensuring adequate access control within blockchain-enabled IoT (BIoT) systems remains a significant challenge. It is often difficult to adapt existing access control mechanisms to the dynamic and context-dependent nature of IoT environments, necessitating a robust context-aware approach to ensure adequate security and the privacy of resources within BIoT systems. In this article, we propose a novel smart contract-enabled context-aware access control (SC-CAAC) scheme for BIoT systems. It utilizes context-aware access control models that consider contextual information, including user profile, purpose, date, time, location, resource, and operating environment specifications, to make access control decisions. Smart contracts dynamically enforce access control policies and manage access permissions, ensuring that sensitive data and resources are accessible only to authorized users. The proposed scheme leverages the immutability, transparency, and decentralization of a blockchain that is shared by multiple participants in a consortium network, removing the need for a central authority to record and audit access control policies and decisions and promoting accountability and trust. The implementation and evaluation of our proposed scheme using the Hyperledger Besu blockchain demonstrates its effectiveness and scalability in real-world scenarios.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "29 February 2024",
        "Page(s)": "19866 - 19881",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2024.3371504",
        "DOI Link": "https://doi.org/10.1109/JIOT.2024.3371504",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain-Based Secure and Efficient Secret Image Sharing With Outsourcing Computation in Wireless Networks",
        "Authors": "Zhili Zhou; Yao Wan; Qi Cui; Keping Yu; Shahid Mumtaz; Ching-Nung Yang; Mohsen Guizani; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10136611/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10136611",
        "Abstract": "Secret Image Sharing (SIS) is the technology that shares any given secret image by generating and distributing n\nshadow images in the way that any subset of k\nshadow images can restore the secret image. However, in the existing SIS schemes, the shadow images will be easily tampered and corrupted during the communication, which will pose serious security issues. Recently, blockchain has emerged as a promising paradigm in the field of data communication and information security. To securely communicate and effectively protect the secret image data in wireless networks, we propose a Blockchain-based Secure and Efficient Secret Image Sharing (BC-SESIS) scheme with outsourcing computation in wireless networks. In the proposed BC-SESIS scheme, the shadow images are encrypted and stored in the blockchain to prevent them from being tampered and corrupted. The identity authentication-enabled smart contract is deployed to achieve the (k,n)\nthreshold for secret image restoring. Furthermore, to reduce the computational burden of smart contract and users, an efficient outsourcing computation method is designed to outsource the restoring task, which is securely implemented by agent miners in the encryption domain. Theoretical analysis and extensive experiments demonstrate that the BC-SESIS scheme can achieve desirable communication security and high computational efficiency in the wireless networks.",
        "Published in": "IEEE Transactions on Wireless Communications",
        "Date of Publication": "25 May 2023",
        "Page(s)": "423 - 435",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TWC.2023.3278108",
        "DOI Link": "https://doi.org/10.1109/TWC.2023.3278108",
        "Publisher": "IEEE"
    },
    {
        "Title": "Decentralized Authentication of Distributed Patients in Hospital Networks Using Blockchain",
        "Authors": "Abbas Yazdinejad; Gautam Srivastava; Reza M. Parizi; Ali Dehghantanha; Kim-Kwang Raymond Choo; Mohammed Aledhari; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8970497/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8970497",
        "Abstract": "In any interconnected healthcare system (e.g., those that are part of a smart city), interactions between patients, medical doctors, nurses and other healthcare practitioners need to be secure and efficient. For example, all members must be authenticated and securely interconnected to minimize security and privacy breaches from within a given network. However, introducing security and privacy-preserving solutions can also incur delays in processing and other related services, potentially threatening patients lives in critical situations. A considerable number of authentication and security systems presented in the literature are centralized, and frequently need to rely on some secure and trusted third-party entity to facilitate secure communications. This, in turn, increases the time required for authentication and decreases throughput due to known overhead, for patients and inter-hospital communications. In this paper, we propose a novel decentralized authentication of patients in a distributed hospital network, by leveraging blockchain. Our notion of a healthcare setting includes patients and allied health professionals (medical doctors, nurses, technicians, etc), and the health information of patients. Findings from our in-depth simulations demonstrate the potential utility of the proposed architecture. For example, it is shown that the proposed architecture's decentralized authentication among a distributed affiliated hospital network does not require re-authentication. This improvement will have a considerable impact on increasing throughput, reducing overhead, improving response time, and decreasing energy consumption in the network. We also provide a comparative analysis of our model in relation to a base model of the network without blockchain to show the overall effectiveness of our proposed solution.",
        "Published in": "IEEE Journal of Biomedical and Health Informatics",
        "Date of Publication": "27 January 2020",
        "Page(s)": "2146 - 2156",
        "Electronic ISSN": "",
        "PubMed ID": "31995507",
        "DOI": "10.1109/JBHI.2020.2969648",
        "DOI Link": "https://doi.org/10.1109/JBHI.2020.2969648",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Blockchain Assisted Vehicular Pseudonym Issuance and Management System for Conditional Privacy Enhancement",
        "Authors": "Donpiti Chulerttiyawong; Abbas Jamalipour; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9536245/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9536245",
        "Abstract": "A feasible approach commonly discussed in the literature for mitigating location privacy threats in vehicular ad hoc networks (VANETs) is the use of pseudonyms instead of real vehicle identifications. However, for relevant authorities to be able to identify misbehaving vehicles through their pseudonyms, it is essential that the privacy protection mechanisms only allow for conditional anonymity and not complete anonymity. In this paper, we propose the use of a permissioned consortium blockchain system with smart contract feature to facilitate secure and conditional privacy-preserving vehicular pseudonym issuance and management in a multi-jurisdictional road network. The use of a permissioned consortium blockchain helps mitigate security risks associated with the complexities in interorganizational data handling, such as in the areas of access control, data integrity, confidentiality, and availability. The proposed system architecture takes advantage of the predicted wide availability of Roadside Units (RSUs), and the highly viable, flexible and mature Public Key Infrastructure (PKI) technology for usage in vehicular pseudonymous communications. We successfully carried out a small-scale simulation of the proposed architecture using the Vehicles in Network Simulation (Veins) platform for integrated traffic and network simulation services (SUMO as the traffic simulator and OMNeT++ as the network simulator), and the Hyperledger Fabric platform as the permissioned consortium blockchain system. Simulation and performance analysis results reveal the feasibility of practical deployment of the scheme, and show that the scheme addresses the identified shortfalls of existing works, including the ability to achieve a better balance between connectivity and storage requirements.",
        "Published in": "IEEE Access",
        "Date of Publication": "13 September 2021",
        "Page(s)": "127305 - 127319",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3112013",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3112013",
        "Publisher": "IEEE"
    },
    {
        "Title": "Space Authentication in the Metaverse: A Blockchain-Based User-Centric Approach",
        "Authors": "Jungwon Seo; Hankyeong Ko; Sooyong Park; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10413466/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10413466",
        "Abstract": "As the metaverse gains attraction, the importance of metaverse security research becomes increasingly evident. While there has been research on authenticating users in the metaverse, there is a notable gap in research concerning the authentication of specific spaces within the metaverse. This paper addresses this gap by proposing a novel user-centric blockchain-based authentication approach that incorporates space authentication. The proposed approach leverages blockchain smart contracts to authenticate users using cosine similarity metrics. A significant advantage of this approach its ability to establish user-centric authentication by seamlessly integrating metaverse and blockchain technologies, all without the need for a centralized authority. In this paper, we not only evaluate the security of our proposed approach but also conduct experiments to determine the cosine similarity threshold and assess its feasibility within a metaverse environment.",
        "Published in": "IEEE Access",
        "Date of Publication": "24 January 2024",
        "Page(s)": "18703 - 18713",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2024.3357938",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2024.3357938",
        "Publisher": "IEEE"
    },
    {
        "Title": "Efficient Certification of Endpoint Control on Blockchain",
        "Authors": "Diego Pennino; Maurizio Pizzonia; Andrea Vitaletti; Marco Zecchini; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9547272/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9547272",
        "Abstract": "Proving that an endpoint (e.g. URL, telephone number, etc.) is controlled by a subject is crucial in many applications. In the web, this is witnessed by the widespread adoption of HTTPS. In centralized architectures, this task is usually carried out by trusted certification authorities (CAs). In decentralized applications, for example based on blockchains, or for self-sovereign identity management (SSI), it would be desirable to perform these checks in a decentralized way, relying on the collective behavior of a society of individuals rather than on a single trusted entity. In any case, the result should be a widely usable certificate, as in the centralized CA case. In this paper, we show two blockchain-based methods to prove the association between a subject and an endpoint in a decentralized manner. Our methods are compatible with a wide variety of endpoints and contribute to fill the gap of the current SSI approaches with respect to decentralization. We analyze the security of our proposal and provide a proof-of-concept implementation. We also evaluate performances, costs, and compatibility with current standardization efforts about SSI.",
        "Published in": "IEEE Access",
        "Date of Publication": "23 September 2021",
        "Page(s)": "133309 - 133334",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3115343",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3115343",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey of Blockchain From the Perspectives of Applications, Challenges, and Opportunities",
        "Authors": "Ahmed Afif Monrat; Olov Schelén; Karl Andersson; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8805074/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8805074",
        "Abstract": "Blockchain is the underlying technology of a number of digital cryptocurrencies. Blockchain is a chain of blocks that store information with digital signatures in a decentralized and distributed network. The features of blockchain, including decentralization, immutability, transparency and auditability, make transactions more secure and tamper proof. Apart from cryptocurrency, blockchain technology can be used in financial and social services, risk management, healthcare facilities, and so on. A number of research studies focus on the opportunity that blockchain provides in various application domains. This paper presents a comparative study of the tradeoffs of blockchain and also explains the taxonomy and architecture of blockchain, provides a comparison among different consensus mechanisms and discusses challenges, including scalability, privacy, interoperability, energy consumption and regulatory issues. In addition, this paper also notes the future scope of blockchain technology.",
        "Published in": "IEEE Access",
        "Date of Publication": "19 August 2019",
        "Page(s)": "117134 - 117151",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2019.2936094",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2019.2936094",
        "Publisher": "IEEE"
    },
    {
        "Title": "SoK of Used Cryptography in Blockchain",
        "Authors": "Mayank Raikwar; Danilo Gligoroski; Katina Kralevska; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8865045/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8865045",
        "Abstract": "The underlying fundaments of blockchain are cryptography and cryptographic concepts that provide reliable and secure decentralized solutions. Although many recent papers study the use-cases of blockchain in different industrial areas, such as finance, health care, legal relations, IoT, information security, and consensus building systems, only few studies scrutinize the cryptographic concepts used in blockchain. To the best of our knowledge, there is no Systematization of Knowledge (SoK) that gives a complete picture of the existing cryptographic concepts which have been deployed or have the potential to be deployed in blockchain. In this paper, we thoroughly review and systematize all cryptographic concepts which are already used in blockchain. Additionally, we give a list of cryptographic concepts which have not yet been applied but have big potentials to improve the current blockchain solutions. We also include possible instantiations of these cryptographic concepts in the blockchain domain. Last but not least, we explicitly postulate 21 challenging problems that cryptographers interested in blockchain can work on.",
        "Published in": "IEEE Access",
        "Date of Publication": "11 October 2019",
        "Page(s)": "148550 - 148575",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2019.2946983",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2019.2946983",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Review of Blockchain Solutions in Supply Chain Traceability",
        "Authors": "",
        "HTML Link": "https://ieeexplore.ieee.org/document/9983981/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9983981",
        "Abstract": "The supply chain plays an important role in daily life, and its traceability ensures product quality and safety. Therefore, an efficient and reliable solution to improve supply chain traceability is urgently needed. Because of its advantages of being decentralized, tamper-proof, and transparent, the emerging blockchain technology should address the problems of unreliable data and low tracking efficiency in traditional traceability systems. This paper explores blockchain-based supply chain traceability solutions, reviews recent research, and identifies challenges. First, the basics of blockchain are introduced, and the traditional traceability model and stakeholder needs are described. Then, the existing publications and enterprise applications are reviewed and analyzed in detail. Using blockchain is found to bring many benefits. It is also found that the current academic solutions are mostly based on mainstream blockchain platforms and lack specific and comprehensive evaluation. Finally, challenges and future research questions are discussed. Future research could focus on designing targeted consensus mechanisms, designing appropriate access control, the role of regulators in the supply chain, etc. This review shows that blockchain has great potential to address traceability issues, but many challenges remain.",
        "Published in": "Tsinghua Science and Technology",
        "Date of Publication": "13 December 2022",
        "Page(s)": "500 - 510",
        "Electronic ISSN": "1007-0214",
        "PubMed ID": "",
        "DOI": "10.26599/TST.2022.9010030",
        "DOI Link": "https://doi.org/10.26599/TST.2022.9010030",
        "Publisher": "TUP"
    },
    {
        "Title": "A Comparative Analysis of Blockchain Architecture and its Applications: Problems and Recommendations",
        "Authors": "Toqeer Ali Syed; Ali Alzahrani; Salman Jan; Muhammad Shoaib Siddiqui; Adnan Nadeem; Turki Alghamdi; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8922632/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8922632",
        "Abstract": "In the past few years, the implementation of blockchain technology for various applications has been widely discussed in the research community and the industry. There are sufficient number of articles that discuss the possibility of applying blockchain technology in various areas, such as, healthcare, IoT, and business. However, in this article, we present a comparative analysis of core blockchain architecture, its fundamental concepts, and its applications in three major areas: the Internet-of-Things (IoT), healthcare, business and vehicular industry. For each area, we discuss in detail, challenges and solutions that have been proposed from the research community and industry. This research studies also presented the complete ecosystem of blockchain of all the papers we reviewed and summarized. Moreover, analysis is performed of various blockchain platforms, their consensus models, and applications. Finally, we discuss key aspects that are required for the widespread future adoption of blockchain technology in these major areas.",
        "Published in": "IEEE Access",
        "Date of Publication": "04 December 2019",
        "Page(s)": "176838 - 176869",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2019.2957660",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2019.2957660",
        "Publisher": "IEEE"
    },
    {
        "Title": "PACTA: An IoT Data Privacy Regulation Compliance Scheme Using TEE and Blockchain",
        "Authors": "Yongxin Zhang; Jiacheng Yang; Hong Lei; Zijian Bao; Ning Lu; Wenbo Shi; Bangdao Chen; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10268608/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10268608",
        "Abstract": "Despite the existence of data privacy regulations, such as the general data protection regulation (GDPR), data leaks in the Internet of Things (IoT) still occur and cause significant harm due to the noncompliance of data users. To address this issue, a notable solution involves recording the process in an open, immutable blockchain and utilizing the trusted execution environment (TEE) for reliable compliance verification. Although substantial progress has been made in designing compliance schemes in recent years, current approaches suffer from various limitations, including compliance incompleteness, regulation faultiness, and privacy leak. This article introduces PACTA, an IoT data privacy regulation compliance scheme that leverages TEE and blockchain technology. In the protocol, PACTA efficiently handles both dynamic and static consent of data owners and utilizes TEE for compliance analysis of requests and processes. By storing encrypted critical data, the blockchain facilitates privacy-preserving audits of the entire compliance process. Additionally, we have designed a challenge–response protocol to address the silent behavior of the TEE. We demonstrate that PACTA effectively enforces regulation compliance while safeguarding privacy. We thoroughly evaluate our implementation’s efficiency and effectiveness using Ethereum and Intel SGX platforms.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "02 October 2023",
        "Page(s)": "8882 - 8893",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2023.3321308",
        "DOI Link": "https://doi.org/10.1109/JIOT.2023.3321308",
        "Publisher": "IEEE"
    },
    {
        "Title": "H²CT: Asynchronous Distributed Key Generation With High-Computational Efficiency and Threshold Security in Blockchain Network",
        "Authors": "Axin Xiang; Hongfeng Gao; Youliang Tian; Jinbo Xiong; Linjie Wang; Changgen Peng; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10605912/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10605912",
        "Abstract": "Asynchronous distributed key generation (ADKG) is a strong-robustness key management technology to bootstrap threshold cryptosystems without a global clock, which can enable decentralized security management for threshold digital wallets in blockchain network. However, the high-computational cost of existing ADKG protocols makes it difficult to remove the “slow” connotation from the word “asynchronous” in a high-threshold security context. In this article, we propose a simpler “two-high” ADKG protocol (H2CT) for blockchain to improve the computational efficiency of asynchronous communications while balancing it with threshold security. Concretely, we first construct a computationally efficient asynchronous complete secret sharing (ACSS) scheme using number theory transformation, reducing the computational complexity of share evaluation from\nO(\nn\n2\n)\nto\nO(nlogn)\nin the dealing phase. To eliminate the negative impact of up to t biased secrets brought by the implicate messages in the agreement phase, we extend the verifiable ACSS scheme to a publicly verifiable ACSS scheme (pvACSS) using Feldman polynomial commitment. Leveraging this enhanced randomness, the matrix computation cost and message size in the remaining phases are reduced to about half that of the existing works, i.e.,\nO(2\nn\n2\n)\n. Finally, considering the high-scalability requirements, the network size n is increased to up to 1024 nodes and the results show that our pvACSS and the derived H2CT reduce the runtime by approximately 33.96 s and 824.46 s, respectively, over the state-of-the-art. Moreover, we perform simulations on an open-source blockchain testbed, fully demonstrating the efficiency advantages of our H2CT protocol.",
        "Published in": "IEEE Internet of Things Journal",
        "Date of Publication": "22 July 2024",
        "Page(s)": "33758 - 33772",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/JIOT.2024.3431554",
        "DOI Link": "https://doi.org/10.1109/JIOT.2024.3431554",
        "Publisher": "IEEE"
    },
    {
        "Title": "The Notarial Office in E-government: A Blockchain-Based Solution",
        "Authors": "Ying Gao; Qiaofeng Pan; Yangliang Liu; Hongliang Lin; Yijian Chen; Quansi Wen; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9380170/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9380170",
        "Abstract": "The Notarial Office(NO), working on providing various essential certificates, still relies on manual handling and requires paper materials from other government departments. That brings lots of inconvenience. The Notarial Office rejects non-local paper materials for their lower credibility in the local place and then cannot provide cross-borders services. It also easily cause sensitive information leakage as copies of paper materials have been stored. In this case, a blockchain-based system is suitable to address challenges in this scenario because of its advantages (e.g, decentralized, immutability, transparency, auditability). We implemented this system on top of the Hyperledger Fabric. Moreover, we replace manual operations with smart contracts, set extra ledgers to off-load different types of transactions and provide encryption for private information when needed. In the end, we get an expected result. That is, the modification outperformed the unmodified network in experiments.",
        "Published in": "IEEE Access",
        "Date of Publication": "17 March 2021",
        "Page(s)": "44411 - 44425",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2021.3066184",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3066184",
        "Publisher": "IEEE"
    },
    {
        "Title": "SIGNORA: A Blockchain-Based Framework for Dataflow Integrity Provisioning in an Untrusted Data Pipeline",
        "Authors": "Yustus Eko Oktian; Shinwook Heo; Howon Kim; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9861623/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9861623",
        "Abstract": "In a typical data pipeline, the dataflow starts from the first node, where the data is initiated, and moves to the last node in the pipeline, where the processed data will be stored. Due to the sheer number of involved participants, it is crucial to protect the dataflow integrity in the pipeline. While previous studies have outlined solutions to this matter, the solution for an untrusted data pipeline is still left unexplored, which motivates us to propose SIGNORA . Our proposal combines the concept of a chain of signatures with blockchain receipt to provide dataflow integrity. The chain of signatures provides a non-repudiation guarantee from participants, while the hash of the data and signatures is anchored in the blockchain for a non-tampering guarantee through blockchain receipt. Aside from that, SIGNORA also satisfies essential requirements of running data pipeline processing in an open and untrusted environment, such as (i) providing reliable identity management, (ii) solving the trust and accountability issues through a reputation system, (iii) supporting various devices through multiple cryptographic algorithms (i.e., ECDSA, EdDSA, RSA, and HMAC), and (iv) off-chain processing. Our experiment results show that SIGNORA can provide dataflow integrity provisioning in multiple scenarios of data payload size with reasonable overhead. Furthermore, the cost of smart contract methods has also been analyzed, and several off-chain solutions have been addressed to reduce transaction costs. Finally, the reputation system can adapt to the history of nodes’ activities by increasing their scores when they actively perform honest behavior while reducing their scores when they become inactive. Therefore, SIGNORA can provide a high degree of accountability for participants collaborating in an untrusted environment.",
        "Published in": "IEEE Access",
        "Date of Publication": "18 August 2022",
        "Page(s)": "89714 - 89731",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3199878",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3199878",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain-Powered Bandwidth Trading on SDN-Enabled Edge Network",
        "Authors": "Yustus Eko Oktian; Thi-Thu-Huong Le; Uk Jo; Howon Kim; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9931132/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9931132",
        "Abstract": "Bandwidth trading procedures can be made to incentivize users to sell their needless traffic and indirectly reduce the probability of traffic congestion. However, implementation of bandwidth trading is opex-heavy from Internet Service Provider (ISP) perspective, while on the other hand, users also do not trust network executions from the ISP due to its heavily centralized control. These issues hinder the applicability of bandwidth trading and become our motivation to propose this paper. Our bandwidth-trading framework utilize software-defined networking (SDN) and blockchain. SDN automates the bandwidth trading executions from the ISP side and reduces the opex. Meanwhile, the smart contract is a trusted platform for building a trading marketplace where buyers, sellers, and SDN controllers can negotiate the trading terms. Once the trading is executed, SDN controllers generate proof of trading that must be submitted to the smart contract as proof of provisioning. We implement our works using Ethereum and POX SDN controllers, and the results prove that it can provide a seamless bandwidth trading experience with reasonable overhead. Furthermore, by committing to our framework, bandwidth trading can be executed fairly and securely because all previous provisioning can be cross-checked through the provided proof-of-trading.",
        "Published in": "IEEE Access",
        "Date of Publication": "26 October 2022",
        "Page(s)": "114024 - 114039",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3217534",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3217534",
        "Publisher": "IEEE"
    },
    {
        "Title": "Study of Blockchains’s Consensus Mechanism Based on Credit",
        "Authors": "Yuhao Wang; Shaobin Cai; Changlong Lin; Zuxi Chen; Tian Wang; Zhenguo Gao; Changli Zhou; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8605507/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8605507",
        "Abstract": "Practical Byzantine fault tolerance (PBFT) is one of the most popular consensus protocols of the blockchain. However, in the PBFT, the enthusiasm of reliable nodes cannot be stimulated effectively, and a large amount of communication resources are used for data consistency. Therefore, a new consensus protocol-credit-delegated Byzantine fault tolerance (CDBFT)-is proposed in this paper. The CDBFT works as the following: 1) a voting rewards and punishments scheme and its corresponding credit evaluation scheme are proposed not only to stimulate enthusiasm of reliable nodes but also to reduce the participation of abnormal nodes in the consensus process, and the virtuous circle of the system can be founded and 2) consistency and checkpoint protocols based on PBFT are proposed to improve the efficiency and flexibility of system. From the simulation results, a conclusion can be drawn, the participation probability of abnormal nodes in the consensus process can be reduced to 5%, and the efficiency and stability of the system are improved greatly in the long-time running.",
        "Published in": "IEEE Access",
        "Date of Publication": "08 January 2019",
        "Page(s)": "10224 - 10231",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2019.2891065",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2019.2891065",
        "Publisher": "IEEE"
    },
    {
        "Title": "LearningChain: A Highly Scalable and Applicable Learning-Based Blockchain Performance Optimization Framework",
        "Authors": "Jishu Wang; Yaowei Wang; Xuan Zhang; Zhi Jin; Chao Zhu; Linyu Li; Rui Zhu; Shenglong Lv; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10375789/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10375789",
        "Abstract": "Blockchain is a trans-generational technology that is gradually introduced and applied in many fields because of its characteristics such as tamper-proof, traceability, and decentralization. However, the performance bottlenecks of blockchain have been one factor that hinders its practical application. This paper proposes a blockchain performance optimization framework (called LearningChain). We use a temporal convolution network to predict the transaction arrival rate of the blockchain and propose an ensemble learning-based method and a meta-learning-based method to train a blockchain performance prediction model, respectively. We design a performance scoring mechanism to dynamically tune the configuration parameters of the blockchain to optimize the blockchain performance. In addition, we collect and contribute a blockchain performance dataset (called HFBTP) for other researchers to research. The sufficient experimental results and analysis show that LearningChain can effectively optimize blockchain performance. The quantitative and qualitative comparisons with related work demonstrate the superiority and innovation of our work, LearningChain reaches state-of-the-art, is highly applicable, scalable, and can be applied to many practical blockchain-based application scenarios and different blockchain platforms. LearningChain can be complemented with other existing blockchain performance optimization tools and methods to further enhance the effectiveness of blockchain performance optimization.",
        "Published in": "IEEE Transactions on Network and Service Management",
        "Date of Publication": "28 December 2023",
        "Page(s)": "1817 - 1831",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TNSM.2023.3347789",
        "DOI Link": "https://doi.org/10.1109/TNSM.2023.3347789",
        "Publisher": "IEEE"
    },
    {
        "Title": "On the Application of Blockchains to Spectrum Management",
        "Authors": "Martin B. H. Weiss; Kevin Werbach; Douglas C. Sicker; Carlos E. Caicedo Bastidas; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8703084/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8703084",
        "Abstract": "Spectrum sharing mechanisms have evolved to meet different needs related to increasing spectrum use efficiency. At first, decentralized and opportunistic cognitive radios (and cognitive radio networks) were the primary focus of research for these mechanisms. This gradually transitioned toward the development of cooperative sharing methods based on databases, typified by TV white spaces databases. Spectrum sharing is now the basis for the dynamic and fine-grained spectrum rights regime for the citizen's band radio service (CBRS) as well as for license shared access (LSA). The emergence of the cryptocurrency Bitcoin has stimulated interest in applying its underlying technology, blockchain, to other applications as well, such as securities trading and supply chain management. This paper explores the application of blockchain to radio spectrum management. While blockchains could underlie radio spectrum management more broadly, we will focus on dynamic spectrum sharing applications. Like the cooperative approaches currently in use, blockchain is a database technology. However, a blockchain is a decentralized database in which the owner of the data maintains control. We consider the benefits and limitations of blockchain solutions in general, and then examine their potential application to four major categories of spectrum sharing.",
        "Published in": "IEEE Transactions on Cognitive Communications and Networking",
        "Date of Publication": "30 April 2019",
        "Page(s)": "193 - 205",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TCCN.2019.2914052",
        "DOI Link": "https://doi.org/10.1109/TCCN.2019.2914052",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Novel Monitoring System for the Data Integrity of Reactor Protection System Using Blockchain Technology",
        "Authors": "Moon Kyoung Choi; Chan Yeob Yeun; Poong Hyun Seong; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9126779/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9126779",
        "Abstract": "Nuclear Power Plants (NPPs) are physically isolated from external networks and have different operational environments than conventional information technology (IT) systems. Accordingly, NPPs were regarded as safe from external cyber-attacks. However, it was later determined that isolated networks are not safe from cyber-attacks. Malicious data injection attacks on Programmable Logic Controllers (PLCs) deployed in the safety system of NPPs are critical to nuclear facilities, as they were in the Stuxnet attack. It is necessary to monitor the integrity of PLC data and protect the PLCs from cyber threats such as modification of deployed logic or setpoints. To address this problem, this paper proposes a novel system for monitoring data integrity of PLCs using blockchain technologies. Considering the NPP environment, we developed a private blockchain system to monitor the data integrity of PLCs. The new concept that is Proof of Monitoring (PoM) for data integrity of PLCs was proposed to overcome the limitation for applying the private blockchain to the cybersecurity of NPPs. Additionally, we developed an integrity monitoring system for the Reactor Protection System (RPS)-a safety system in NPPs-using the developed blockchain. It can detect cyber-attacks (such as false code injection attacks on PLCs) and monitor which PLC integrity has been compromised in real-time. A validation experiment using a false data injection attack on PLCs was performed on the developed system, and the results confirmed that the developed system successfully monitored the modification of data in the PLCs.",
        "Published in": "IEEE Access",
        "Date of Publication": "26 June 2020",
        "Page(s)": "118732 - 118740",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.3005134",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.3005134",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Survey on Privacy-Preserving Blockchain Systems (PPBS) and a Novel PPBS-Based Framework for Smart Agriculture",
        "Authors": "Quang Nhat Tran; Benjamin P. Turnbull; Hao-Tian Wu; A. J. S. de Silva; Katerina Kormusheva; Jiankun Hu; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9329051/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9329051",
        "Abstract": "Blockchain and smart contracts have seen significant application over the last decade, revolutionising many industries, including cryptocurrency, finance and banking, and supply chain management. In many cases, however, the transparency provided potentially comes at the cost of privacy. Blockchain does have potential uses to increase privacy-preservation. This paper outlines the current state of privacy preservation utilising Blockchain and Smart Contracts, as applied to a number of fields and problem domains. It provides a background of blockchain, outlines the challenges in blockchain as they relate to privacy, and then classifies into areas in which this paradigm can be applied to increase or protect privacy. These areas are cryptocurrency, data management and storage, e-voting, the Internet of Things, and smart agriculture. This work then proposes PPSAF, a new privacy-preserving framework designed explicitly for the issues that are present in smart agriculture. Finally, this work outlines future directions of research in areas combining future technologies, privacy-preservation and blockchain.",
        "Published in": "IEEE Open Journal of the Computer Society",
        "Date of Publication": "20 January 2021",
        "Page(s)": "72 - 84",
        "Electronic ISSN": "2644-1268",
        "PubMed ID": "",
        "DOI": "10.1109/OJCS.2021.3053032",
        "DOI Link": "https://doi.org/10.1109/OJCS.2021.3053032",
        "Publisher": "IEEE"
    },
    {
        "Title": "Crypto Pharmacy – Digital Medicine: A Mobile Application Integrated With Hybrid Blockchain to Tackle the Issues in Pharma Supply Chain",
        "Authors": "Ganesan Subramanian; Anand Sreekantan Thampy; Nnamdi Valbosco Ugwuoke; Baghwan Ramnani; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9314090/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9314090",
        "Abstract": "Mobile application integrated with cryptocurrency would be an innovative solution for making medicine purchase in the future. This research work fixates on the design and implementation of a crypto pharmacy - digital medicine utilizing hybrid blockchain technology. We present the concept of crypto medicine that eliminates third-party presence (buy/sell) in a medicine purchase. The proposed design integrates the mobile application with the NEM blockchain. The manufacturer engenders the digital medicines with NEM blockchain namespace, all the pharma products are assigned with NEM cryptocurrency XEM, labeled with a QR code. Our archetype model (perspicacious detector) executes the astute contract that connects all the stakeholders in a pharma supply chain. The proposed mobile application has been prosperously integrated with NEM cryptocurrency by assigning XEM for the medicines, all the transactions are monitored in a blockchain from manufacturer to culminate-utilizer. The mobile application designed utilizing apple iOS integrated with nem2sdk swift framework. This system evades a few millions worth of substandard medicine integrated in the ecumenical market every year. In additament to crypto medicine, the genuine-time monitoring of liquid medicine has been tested with the IoT platform. It fetches the temperature data into the blockchain and authenticates the reliability of medicine for intensive care unit patients.",
        "Published in": "IEEE Open Journal of the Computer Society",
        "Date of Publication": "05 January 2021",
        "Page(s)": "26 - 37",
        "Electronic ISSN": "2644-1268",
        "PubMed ID": "",
        "DOI": "10.1109/OJCS.2021.3049330",
        "DOI Link": "https://doi.org/10.1109/OJCS.2021.3049330",
        "Publisher": "IEEE"
    },
    {
        "Title": "Visualization of Blockchain Data: A Systematic Review",
        "Authors": "Natkamon Tovanich; Nicolas Heulot; Jean-Daniel Fekete; Petra Isenberg; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8945380/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8945380",
        "Abstract": "We present a systematic review of visual analytics tools used for the analysis of blockchains-related data. The blockchain concept has recently received considerable attention and spurred applications in a variety of domains. We systematically and quantitatively assessed 76 analytics tools that have been proposed in research as well as online by professionals and blockchain enthusiasts. Our classification of these tools distinguishes (1) target blockchains, (2) blockchain data, (3) target audiences, (4) task domains, and (5) visualization types. Furthermore, we look at which aspects of blockchain data have already been explored and point out areas that deserve more investigation in the future.",
        "Published in": "IEEE Transactions on Visualization and Computer Graphics",
        "Date of Publication": "30 December 2019",
        "Page(s)": "3135 - 3152",
        "Electronic ISSN": "",
        "PubMed ID": "31899429",
        "DOI": "10.1109/TVCG.2019.2963018",
        "DOI Link": "https://doi.org/10.1109/TVCG.2019.2963018",
        "Publisher": "IEEE"
    },
    {
        "Title": "Exploring Blockchain Architectures for Network Sharing: Advantages, Limitations, and Suitability",
        "Authors": "Engin Zeydan; Suayb S. Arslan; Yekta Turk; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10315214/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10315214",
        "Abstract": "The increasing demand for mobile data services has led to a need for efficient and cost-effective network sharing solutions. Blockchain technology has emerged as a promising solution for addressing the challenges associated with network sharing, such as interoperability, trust, and accountability. This paper presents a comprehensive classification and categorization of blockchain-based network sharing scenarios, highlighting their advantages and limitations. We have identified seven network sharing scenarios, ranging from centralized network sharing to fully decentralized spectrum sharing. For each scenario, the suitability of some of the selected blockchain architectures, from public, private, sidechain, and hybrid, is evaluated through extensive evaluations. We also identify gaps and opportunities of blockchain-based network sharing solution and present future research directions at the end of paper. Our analysis and results reveal that a single blockchain architecture is not suitable for all network sharing scenarios but careful analysis should be performed when selecting the suitable blockchain network in network sharing.",
        "Published in": "IEEE Transactions on Network and Service Management",
        "Date of Publication": "13 November 2023",
        "Page(s)": "1791 - 1801",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TNSM.2023.3331307",
        "DOI Link": "https://doi.org/10.1109/TNSM.2023.3331307",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain-Based Identity Management: A Survey From the Enterprise and Ecosystem Perspective",
        "Authors": "Michael Kuperberg; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8792372/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8792372",
        "Abstract": "Identity management is a core building block for the majority of software solutions and landscapes. Competing with existing identity-managing solutions, blockchain-based concepts and products have evolved in the context of verified claims and self-sovereign identities. The contribution of this paper is a systematic, criteria-driven survey of the solutions and technologies for this growing field and their comparison with the capabilities of established solutions. By including an extensive set of requirements covering ecosystem aspects, end-user functionality, mobility and overhead aspects, compliance/liability, EU regulations, standardization, and integration, this paper shows the highlights and the deficits of a wide array of solutions.",
        "Published in": "IEEE Transactions on Engineering Management",
        "Date of Publication": "08 August 2019",
        "Page(s)": "1008 - 1027",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TEM.2019.2926471",
        "DOI Link": "https://doi.org/10.1109/TEM.2019.2926471",
        "Publisher": "IEEE"
    },
    {
        "Title": "Trustworthy IoT Data Streaming Using Blockchain and IPFS",
        "Authors": "Haya R. Hasan; Khaled Salah; Ibrar Yaqoob; Raja Jayaraman; Sasa Pesic; Mohammed Omar; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9705291/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9705291",
        "Abstract": "Today’s resource-constrained IoT streaming devices generate large amounts of data which is stored, processed, analyzed for value creation, and accessed using centralized systems, technologies, platforms, and services. Most existing systems leveraged for storing and accessing IoT streaming data fall short in providing transparency, traceability, reliability, trustworthiness, and security features. Also, they are vulnerable to the single point of failure problem due to centralization. In this paper, we propose a blockchain-based solution for resource-constrained IoT streaming devices that allows data chunks to be transferred in a decentralized, transparent, traceable, reliable, secure, and trustful manner. We preserve the privacy and confidentiality of the IoT streamed data through a proxy re-encryption network. We use the decentralized storage of the Interplanetary File System (IPFS) to store and share the IoT streaming data, thereby dealing with the large-size data storage problem. We present system diagrams and eleven algorithms along with their full implementation details. We perform security analysis to show our smart contract code is secure enough against well-known security threats and vulnerabilities. We compare our proposed approach with the existing solutions to show its novelty and effectiveness. We make our smart contract code publicly available on the GitHub repository.",
        "Published in": "IEEE Access",
        "Date of Publication": "07 February 2022",
        "Page(s)": "17707 - 17721",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3149312",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3149312",
        "Publisher": "IEEE"
    },
    {
        "Title": "Sec-Health: A Blockchain-Based Protocol for Securing Health Records",
        "Authors": "Leonardo Da Costa; Billy Pinheiro; Weverton Cordeiro; Roberto Araújo; Antônio Abelém; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10044680/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10044680",
        "Abstract": "Storing and sharing health records through electronic systems pose security risks. To address them, several countries’ regulations have established that healthcare information systems must fulfill security properties (confidentiality, access control, integrity, revocation and anonymity) and complementary ones (emergency access and interoperability). Upon tackling these issues, several proposals present security limitations and/or address specific properties only. We propose Sec-Health, a blockchain-based protocol that secures health records, addressing all of the main security and complementary properties defined in current regulations. We show that Sec-Health is a suitable solution by analyzing it under several attack scenarios and describing how it overcomes the problems of existing solutions. Furthermore, we evaluate a Sec-Health Proof of Concept, showing that it can reduce from 26% up to 90% the time to access health records, and reduce up to 50% client-side memory overhead, compared to related work.",
        "Published in": "IEEE Access",
        "Date of Publication": "14 February 2023",
        "Page(s)": "16605 - 16620",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2023.3245046",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2023.3245046",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Blockchain-Based Trusted Upload Scheme for the Internet of Things Nodes",
        "Authors": "",
        "HTML Link": "https://ieeexplore.ieee.org/document/9815842/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9815842",
        "Abstract": "In recent years, the theory and method of swarm intelligence based on the Internet have become the core research field of the new generation of Internet of Things (IoT). Both play a basic and supporting role in other research fields of IoT. With the popularization and development of crowd network systems, massive swarm intelligence data have brought unprecedented challenges to traditional centralized data management. The most prominent is the aspect of privacy and security. In view of the fact that source data are easy to be tampered with and stolen, and there is a lack of credit guarantee mechanism in information sharing, a blockchain-based trusted uploading scheme of IoT nodes is proposed. It carries out trusted design from three dimensions of node hardware, transmission link, and platform and provides relevant references for similar designs.",
        "Published in": "International Journal of Crowd Science",
        "Date of Publication": "June 2022",
        "Page(s)": "92 - 97",
        "Electronic ISSN": "2398-7294",
        "PubMed ID": "",
        "DOI": "10.26599/IJCS.2022.9100010",
        "DOI Link": "https://doi.org/10.26599/IJCS.2022.9100010",
        "Publisher": "TUP"
    },
    {
        "Title": "A Blockchain-Based Cross-Domain and Autonomous Access Control Scheme for Internet of Things",
        "Authors": "Xiaohan Hao; Wei Ren; Yangyang Fei; Tianqing Zhu; Kim-Kwang Raymond Choo; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9786793/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9786793",
        "Abstract": "The volume, variety and value of data generated by Internet of Things (IoT) devices are expected to increase significantly in foreseeable future, hence, reinforcing the importance of secure and efficient access control solutions for these devices and their networks. However, existing access control solutions are not generally lightweight or scalable, particularly for geographically disperse, inexpensive resource constrained IoT devices. To tackle above challenges, we propose a lightweight consortium blockchain based architecture to enable intelligent autonomous access control for IoT devices. In our architecture, intelligent blockchain facilitates the storing of access policies, provision of authentication services for data access control, and trust evaluation for access request nodes through token accumulation mechanism. Specifically, the user's access request is approved only after it is confirmed by the blockchain network. To ensure the reliability of authenticity, a compromised resistant consensus algorithm is adapted and implemented to defend against at most\n1/3\ncompromised authenticators. In addition, a cross-domain and flexible access control model is not only used to support data sharing among various users but can also be used for access control for exceptional blockchain situations. We explain how our system meets our design goals of reliability, availability, confidentiality, integrity, lightweight, security and scalability. In addition, we also analyze the proposed system's performance from computational, storage and network overheads (e.g., running cryptographic algorithms on a Raspberry Pi 4B), and the findings suggest that the time to run typical cryptographic algorithms is in the microsecond range.",
        "Published in": "IEEE Transactions on Services Computing",
        "Date of Publication": "02 June 2022",
        "Page(s)": "773 - 786",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TSC.2022.3179727",
        "DOI Link": "https://doi.org/10.1109/TSC.2022.3179727",
        "Publisher": "IEEE"
    },
    {
        "Title": "Conditional Anonymous Remote Healthcare Data Sharing Over Blockchain",
        "Authors": "Jingwei Liu; Weiyang Jiang; Rong Sun; Ali Kashif Bashir; Mohammad Dahman Alshehri; Qiaozhi Hua; Keping Yu; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9797064/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9797064",
        "Abstract": "As an important carrier of healthcare data, Electronic Medical Records (EMRs) generated from various sensors, i.e., wearable, implantable, are extremely valuable research materials for artificial intelligence and machine learning. The efficient circulation of EMRs can improve remote medical services and promote the development of the related healthcare industry. However, in traditional centralized data sharing architectures, the balance between privacy and traceability still cannot be well handled. To address the issue that malicious users cannot be locked in the fully anonymous sharing schemes, we propose a trackable anonymous remote healthcare data storing and sharing scheme over decentralized consortium blockchain. Through an “on-chain & off-chain” model, it relieves the massive data storage pressure of medical blockchain. By introducing an improved proxy re-encryption mechanism, the proposed scheme realizes the fine-gained access control of the outsourced data, and can also prevent the collusion between semi-trusted cloud servers and data requestors who try to reveal EMRs without authorization. Compared with the existing schemes, our solution can provide a lower computational overhead in repeated EMRs sharing, resulting in a more efficient overall performance.",
        "Published in": "IEEE Journal of Biomedical and Health Informatics",
        "Date of Publication": "15 June 2022",
        "Page(s)": "2231 - 2242",
        "Electronic ISSN": "",
        "PubMed ID": "35704539",
        "DOI": "10.1109/JBHI.2022.3183397",
        "DOI Link": "https://doi.org/10.1109/JBHI.2022.3183397",
        "Publisher": "IEEE"
    },
    {
        "Title": "IoMT: A COVID-19 Healthcare System Driven by Federated Learning and Blockchain",
        "Authors": "Omaji Samuel; Akogwu Blessing Omojo; Abdulkarim Musa Onuja; Yunisa Sunday; Prayag Tiwari; Deepak Gupta; Ghulam Hafeez; Adamu Sani Yahaya; Oluwaseun Jumoke Fatoba; Shahab Shamshirband; ; ; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9684698/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9684698",
        "Abstract": "Internet of medical things (IoMT) has made it possible to collect applications and medical devices to improve healthcare information technology. Since the advent of the pandemic of coronavirus (COVID-19) in 2019, public health information has become more sensitive than ever. Moreover, different news items incorporated have resulted in differing public perceptions of COVID-19, especially on the social media platform and infrastructure. In addition, the unprecedented virality and changing nature of COVID-19 makes call centres to be likely overstressed, which is due to a lack of authentic and unregulated public media information. Furthermore, the lack of data privacy has restricted the sharing of COVID-19 information among health institutions. To resolve the above-mentioned limitations, this paper is proposing a privacy infrastructure based on federated learning and blockchain. The proposed infrastructure has the potentials to enhance the trust and authenticity of public media to disseminate COVID-19 information. Also, the proposed infrastructure can effectively provide a shared model while preserving the privacy of data owners. Furthermore, information security and privacy analyses show that the proposed infrastructure is robust against information security-related attacks.",
        "Published in": "IEEE Journal of Biomedical and Health Informatics",
        "Date of Publication": "18 January 2022",
        "Page(s)": "823 - 834",
        "Electronic ISSN": "",
        "PubMed ID": "35041615",
        "DOI": "10.1109/JBHI.2022.3143576",
        "DOI Link": "https://doi.org/10.1109/JBHI.2022.3143576",
        "Publisher": "IEEE"
    },
    {
        "Title": "On the Design of Blockchain-Based ECDSA With Fault-Tolerant Batch Verification Protocol for Blockchain-Enabled IoMT",
        "Authors": "Hu Xiong; Chuanjie Jin; Mamoun Alazab; Kuo-Hui Yeh; Hanxiao Wang; Thippa Reddy Gadekallu; Weizheng Wang; Chunhua Su; ; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9540329/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9540329",
        "Abstract": "The blockchain-enabled internet of medical things (IoMT) is an emerging paradigm that could provide strong trust establishment and ensure the traceability of data sharing in the IoMT networks. One of the fundamental building blocks for Blockchain is Elliptic Curve Digital Signature Algorithm (ECDSA). Nevertheless, when processing a large number of transactions, the verification of multiple signatures will incur cumbersome overhead to the nodes in Blockchain. Although batch verification is able to provide a promising approach that verifies multiple signatures simultaneously and efficiently, the upper bound of batch size is limited to small-scale and the efficiency will drop rapidly as the batch size grows in the state-of-the-art ECDSA batch schemes. Meanwhile, most of the existing researches only focus on improving the efficiency of batch verification algorithms in various cryptosystem while ignoring the identification of invalid signatures, which could cause severe performance degradation when the batch verification fails. Motivated by these observations, this paper proposes an efficient and large-scale batch verification scheme with group testing technology based on ECDSA. The application of the presented protocols in Bitcoin and Hyperledger Fabric has been analyzed as supportive and effective. When the batch verification returns a false result, we utilize group testing technology to improve the efficiency of identifying invalid signatures. Comprehensive simulation results demonstrate that our protocol outperforms the related ECDSA batch verification schemes.",
        "Published in": "IEEE Journal of Biomedical and Health Informatics",
        "Date of Publication": "16 September 2021",
        "Page(s)": "1977 - 1986",
        "Electronic ISSN": "",
        "PubMed ID": "34529581",
        "DOI": "10.1109/JBHI.2021.3112693",
        "DOI Link": "https://doi.org/10.1109/JBHI.2021.3112693",
        "Publisher": "IEEE"
    },
    {
        "Title": "RBaaS: A Robust Blockchain as a Service Paradigm in Cloud-Edge Collaborative Environment",
        "Authors": "Zhengong Cai; Guozheng Yang; Shaoyong Xu; Cheng Zang; Jiajun Chen; Pingping Hang; Bowei Yang; ; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9740132/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9740132",
        "Abstract": "As a decentralized distributed ledger, blockchain is endowed with immutability, traceability, anonymity, and transparency, which has got rapid development in cryptocurrency and production as a new trend. In the meantime, the occurrence of Blockchain-as-a-Service (BaaS) helps in mitigation of the complexity and difficulty in deployment and management of blockchain systems and makes it easier to concentrate on business logic implementation for developers. However, most existing BaaS systems are hosted in the environment of cloud vendors, which has also incurred vendor lock-in risk and impairs the inherent trustless characteristic of blockchain. Though present BaaS systems own a level of availability by using cloud computing or edge computing as infrastructure, the availability is limited, considering the availability of network connections and the data center itself. In this article, a novel cloud-edge collaborative BaaS paradigm is proposed. With the assistance of redundant blockchain node candidates, leader election, and edge network self-healing components, the proposed BaaS system is equipped to extend BaaS to the on-premises edge or private cloud, and realize high availability of blockchain systems in edge-autonomy and cross-data-center scenarios. Through testing a simplified system in a simulated environment in cloud servers, this proposed BaaS system has an acceptable throughput under specific transaction sending rates without much performance degradation due to containerization and data synchronization compared with the original blockchain on-premises deployment method.",
        "Published in": "IEEE Access",
        "Date of Publication": "23 March 2022",
        "Page(s)": "35437 - 35444",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2022.3161744",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2022.3161744",
        "Publisher": "IEEE"
    },
    {
        "Title": "Countering Active Attacks on RAFT-Based IoT Blockchain Networks",
        "Authors": "Hasan Mujtaba Buttar; Waqas Aman; M. Mahboob Ur Rahman; Qammer H. Abbasi; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/10134526/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=10134526",
        "Abstract": "",
        "Published in": "",
        "Date of Publication": "",
        "Page(s)": "",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "",
        "DOI Link": "",
        "Publisher": ""
    },
    {
        "Title": "A Secure FaBric Blockchain-Based Data Transmission Technique for Industrial Internet-of-Things",
        "Authors": "Wei Liang; Mingdong Tang; Jing Long; Xin Peng; Jianlong Xu; Kuan-Ching Li; ; ; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8673633/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8673633",
        "Abstract": "The previous blockchain data transmission techniques in industrial Internet of Things (IoT) have low security, high management cost of the trading center, and big difficulty in supervision. To address these issues, this paper proposes a secure FaBric blockchain-based data transmission technique for industrial IoT. This technique uses the blockchain-based dynamic secret sharing mechanism. A reliable trading center is realized using the power blockchain sharing model, which can also share power trading books. The power data consensus mechanism and dynamic linked storage are designed to realize the secure matching of the power data transmission. Experiments show that the optimized FaBric power data storage and transmission has high security and reliability. The proposed technique can improve the transmission rate and packet receiving rate by 12% and 13%, respectively. Moreover, the proposed technique has good superiority in sharing management and decentralization.",
        "Published in": "IEEE Transactions on Industrial Informatics",
        "Date of Publication": "25 March 2019",
        "Page(s)": "3582 - 3592",
        "Electronic ISSN": "",
        "PubMed ID": "",
        "DOI": "10.1109/TII.2019.2907092",
        "DOI Link": "https://doi.org/10.1109/TII.2019.2907092",
        "Publisher": "IEEE"
    },
    {
        "Title": "A Systematic Review of Blockchain in Healthcare: Frameworks, Prototypes, and Implementations",
        "Authors": "Emeka Chukwu; Lalit Garg; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8972918/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8972918",
        "Abstract": "Blockchain, a form of distributed ledger technology has attracted the interests of stakeholders across several sectors including healthcare. Its' potential in the multi-stakeholder operated sector like health has been responsible for several investments, studies, and implementations. Electronic Health Records (EHR) systems traditionally used for the exchange of health information amongst healthcare stakeholders have been criticised for centralising power, failures and attack-points with exchange data custodians. EHRs have struggled in the face of multi-stakeholder and system requirements while adhering to security, privacy, ethical and other regulatory constraints. Blockchain is promising amongst others to address the many EHR challenges, primarily trustless and secure exchange of health information amongst stakeholders. Many blockchain-in-healthcare frameworks have been proposed; some prototyped and/or implemented. This study leveraged the PRISMA framework to systematically search and evaluate the different models proposed; prototyped and/or implemented. The bibliometric and functional distribution of all 143 articles from this study were presented. This study evaluated 61 articles that discussed either prototypes or pilot or implementations. The technical and architectural analysis of these 61 articles for privacy, security, cost, and performance were detailed. Blockchain was found to solve the trust, security and privacy constraints of traditional EHRs often at significant performance, storage and cost trade-offs.",
        "Published in": "IEEE Access",
        "Date of Publication": "28 January 2020",
        "Page(s)": "21196 - 21214",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2020.2969881",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2020.2969881",
        "Publisher": "IEEE"
    },
    {
        "Title": "Blockchain and AI-Based Solutions to Combat Coronavirus (COVID-19)-Like Epidemics: A Survey",
        "Authors": "Dinh C. Nguyen; Ming Ding; Pubudu N. Pathirana; Aruna Seneviratne; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/9468676/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9468676",
        "Abstract": "The beginning of 2020 has seen the emergence of coronavirus outbreak caused by a novel virus called SARS-CoV-2. The sudden explosion and uncontrolled worldwide spread of COVID-19 show the limitations of existing healthcare systems in timely handling public health emergencies. In such contexts, innovative technologies such as blockchain and Artificial Intelligence (AI) have emerged as promising solutions for fighting coronavirus epidemic. In particular, blockchain can combat pandemics by enabling early detection of outbreaks, ensuring the ordering of medical data, and ensuring reliable medical supply chain during the outbreak tracing. Moreover, AI provides intelligent solutions for identifying symptoms caused by coronavirus for treatments and supporting drug manufacturing. Therefore, we present an extensive survey on the use of blockchain and AI for combating COVID-19 epidemics. First, we introduce a new conceptual architecture which integrates blockchain and AI for fighting COVID-19. Then, we survey the latest research efforts on the use of blockchain and AI for fighting COVID-19 in various applications. The newly emerging projects and use cases enabled by these technologies to deal with coronavirus pandemic are also presented. A case study is also provided using federated AI for COVID-19 detection. Finally, we point out challenges and future directions that motivate more research efforts to deal with future coronavirus-like epidemics.",
        "Published in": "IEEE Access",
        "Date of Publication": "30 June 2021",
        "Page(s)": "95730 - 95753",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "34812398",
        "DOI": "10.1109/ACCESS.2021.3093633",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2021.3093633",
        "Publisher": "IEEE"
    },
    {
        "Title": "Secure Service Provisioning Scheme for Lightweight IoT Devices With a Fair Payment System and an Incentive Mechanism Based on Blockchain",
        "Authors": "Turki Ali Alghamdi; Ishtiaq Ali; Nadeem Javaid; Muhammad Shafiq; ; ; ; ",
        "HTML Link": "https://ieeexplore.ieee.org/document/8938743/",
        "PDF Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8938743",
        "Abstract": "The Internet of Things (IoT) industry is growing very fast to transform factories, homes, farms and practically everything else to make them efficient and intelligent. IoT is applied in different resilient scenarios and applications. IoT faces lots of challenges due to lack of computational power, battery and storage resources. Fortunately, the rise of blockchain technology facilitates IoT in many security solutions. Using blockchain, communication between IoT and emerging computing technologies is made efficient. In this work, we propose a secure service provisioning scheme with a fair payment system for Lightweight Clients (LCs) based on blockchain. Furthermore, an incentive mechanism based on reputation is proposed. We use consortium blockchain with the Proof of Authority (PoA) consensus mechanism. Furthermore, we use Smart Contracts (SCs) to validate the services provided by the Service Providers (SPs) to the LCs, transfer cryptocurrency to the SPs and maintain the reputation of the SPs. Moreover, the Keccak256 hashing algorithm is used for converting the data of arbitrary size to the hash of fixed size. AES128 encryption technique is used to encrypt service codes before sending to the LCs. The simulation results show that the LCs receive validated services from the SPs at an affordable cost. The results also depict that the participation rate of SPs is increased because of the incentive mechanism.",
        "Published in": "IEEE Access",
        "Date of Publication": "23 December 2019",
        "Page(s)": "1048 - 1061",
        "Electronic ISSN": "2169-3536",
        "PubMed ID": "",
        "DOI": "10.1109/ACCESS.2019.2961612",
        "DOI Link": "https://doi.org/10.1109/ACCESS.2019.2961612",
        "Publisher": "IEEE"
    }
]